[
  {
    "name": "a management position is not a promotion. It is a change in career",
    "url": "https://fractio.nl/2014/09/19/not-a-promotion-a-career-change/"
  },
  {
    "name": "17 Reasons not to be a Manager",
    "url": "https://charity.wtf/2019/09/08/reasons-not-to-be-a-manager/",
    "description": "An article to discourage the faint-hearted recruits."
  },
  {
    "name": "Advice to New Managers: Don't Joke About Firing People",
    "url": "https://staysaasy.com/engineering/2020/06/09/Don%27t-Joke.html",
    "description": "“The second you became their manager you forfeited the right to joke around in any capacity about their employment at the company.”"
  },
  {
    "name": "Advice to new managers",
    "url": "https://twitter.com/ValaAfshar/status/966125964861280256",
    "description": "9 fundamental principles of the behavior required to be a great manager."
  },
  {
    "name": "Mistakes I've Made as an Engineering Manager",
    "url": "https://css-tricks.com/mistakes-ive-made-as-an-engineering-manager/",
    "description": "Mistakes: “1) Thinking people give feedback the way they want to receive it; 2) Trying to do everything yourself; 3) Communicating something one time is enough; 4) You have to have everything together all the time.”"
  },
  {
    "name": "Why It's Easier to Manage 4 People Than It Is to Manage 1 Person",
    "url": "https://staysaasy.com/management/2020/07/24/Managing-One-Person.html",
    "description": "“Avoid at all costs the combination of: new manager, 1 report, report is new-to-industry, manager is not a subject-matter expert.”"
  },
  {
    "name": "Going from Developer to Manager. What should I know or learn?",
    "url": "https://news.ycombinator.com/item?id=18823616"
  },
  {
    "name": "How to be a Manager – A step-by-step guide to leading a team",
    "url": "https://getweeklyupdate.com/manager-guide",
    "description": "A full, detailed guide on modern management practices."
  },
  {
    "name": "On being an Engineering Manager",
    "url": "https://ruiper.es/posts/engineer-manager-2017/",
    "description": "Some of these points needs nuance, but others are a good taste of things to come for first-time managers."
  },
  {
    "name": "Responsibility vs. accountability",
    "url": "https://news.ycombinator.com/item?id=21892816",
    "description": "The biggest difference between manager (accountable) and engineers (responsible): “'Bad things' happen for the person accountable, whereas the person responsible can move on to the next project.”"
  },
  {
    "name": "IBM slide from 1979",
    "url": "https://twitter.com/mit_csail/status/1604884273789603842",
    "description": "An IBM slide from 1979."
  },
  {
    "name": "source",
    "url": "https://news.ycombinator.com/item?id=18222488"
  },
  {
    "name": "source",
    "url": "https://news.ycombinator.com/item?id=23973859",
    "description": "A recipe on how to work with your direct reports, from a section of 7 habits of highly effective people."
  },
  {
    "name": "The One Minute Manager Meets the Monkey",
    "url": "https://www.amazon.com/dp/0688103804?&linkCode=ll1&tag=kevideld-20&linkId=704eff2e2cddae6d97ef082a6f25bafd&language=en_US&ref_=as_li_ss_tl",
    "description": "The author use a parable in which problems are monkeys. Unexperienced managers let monkeys being transferred to them, accumulates on their back and compounds. From this, the book teach you how to change from taking on responsibilities to delegating them so you don't become a bottleneck."
  },
  {
    "name": "Building and Motivating Engineering Teams",
    "url": "http://www.elidedbranches.com/2016/11/building-and-motivating-engineering.html",
    "description": "What DO engineers want? Money, purpose and respect."
  },
  {
    "name": "What Google Learned From Its Quest to Build the Perfect Team",
    "url": "https://www.nytimes.com/2016/02/28/magazine/what-google-learned-from-its-quest-to-build-the-perfect-team.html",
    "description": "“Google's data indicated that psychological safety, more than anything else, was critical to making a team work. (…) The behaviors that create psychological safety — conversational turn-taking and empathy — are part of the same unwritten rules we often turn to, as individuals, when we need to establish a bond.”"
  },
  {
    "name": "Paper we love: Software Engineering Organizations",
    "url": "https://github.com/papers-we-love/papers-we-love/tree/master/software_engineering_orgs",
    "description": "“The practice of software engineering, and its history is, itself, a complex study in humanity, coordination, and communication.”"
  },
  {
    "name": "Developer Tropes: \"Google does it\"",
    "url": "https://tomaytotomato.com/developer-tropes-2/",
    "description": "It's cargo-cultish to imitate the big names in our industry as a path to success. Instead, the take home from this article “would be that managers and other leaders should be like ecologists; who measure, observe and nurture their ecosystems. Doing so will help build a unique workplace that will yield great results.”"
  },
  {
    "name": "What do executives do, anyway?",
    "url": "https://apenwarr.ca/log/20190926",
    "description": "Paraphrasing Andy Grove's book, High Output Management, “the job of an executive is: to define and enforce culture and values for their whole organization, and to ratify good decisions.” The article also details the failures modes of a CEO: forcing his own decisions downstream, or various ways of not resolving conflicts."
  },
  {
    "name": "Executives ratify decisions made on the spot",
    "url": "https://twitter.com/kdeldycke/status/1088001688722644992",
    "description": "Refines the concept above adapting Tolstoy's thesis to business."
  },
  {
    "name": "Army Leadership and the Profession",
    "url": "https://fas.org/irp/doddir/army/adp6_22.pdf",
    "description": "Establishes and describes what leaders should be and do."
  },
  {
    "name": "US Air Force's Strategic Leadership Studies",
    "url": "https://web.archive.org/web/20190308062113/http://leadership.au.af.mil/sls-skil.htm",
    "description": "A reference of leadership's competencies and skills."
  },
  {
    "name": "What Only the CEO Can Do",
    "url": "https://hbr.org/2009/05/what-only-the-ceo-can-do",
    "description": "“1. Defining and interpreting the meaningful \"outside\" of the company; 2. Answering the two-part question: What business are we in and what business are we not in? 3. Balancing sufficient yield in the present with necessary investment in the future; 4. Shaping the values and standards of the organization.”"
  },
  {
    "name": "How CEOs Manage Time",
    "url": "https://hbr.org/2018/07/the-leaders-calendar",
    "description": "A study on what CEO of large companies spent their time on, and how. Opens a new window into what leadership is all about and into its many components and dimensions."
  },
  {
    "name": "Operations and Internal Communication Strategies For Effective CEOs",
    "url": "https://www.sametab.com/blog/operations-and-internal-communication-strategies-for-effective-ceos",
    "description": "After insisting on the importance of context and narratives, the author provide an interesting template (good for inspiration) of ritual and recurring internal communication devices."
  },
  {
    "name": "Regis McKenna's talk at Silicon Valley Leaders Symposium",
    "url": "https://youtu.be/5Z13NI0SuyA?t=2026",
    "description": "“These are the things we (marketers) used to do with individuals and bodies. They've all become automated. The CIO is the marketing chief now.”"
  },
  {
    "name": "Narcissistic CEOs Weaken Collaboration and Integrity",
    "url": "https://www.gsb.stanford.edu/insights/narcissistic-ceos-weaken-collaboration-integrity",
    "description": "“The prototypic visionary leader profile is so similar to that of a narcissist, if boards aren't careful, they're going to end up choosing people who are narcissistic as CEOs”."
  },
  {
    "name": "source",
    "url": "https://twitter.com/kellan/status/1205113384632500224"
  },
  {
    "name": "source",
    "url": "https://news.ycombinator.com/item?id=24519247",
    "description": "Or how fraud can endure at the top level. That's generally why you need a board of directors as an oversight."
  },
  {
    "name": "CTO vs VP Engineering: What's the Difference?",
    "url": "https://www.ivyexec.com/career-advice/2015/cto-versus-vp-engineering-whats-the-difference/",
    "description": "CTO manage a small staff of hackers. VP of Engineering lead an organization of engineers."
  },
  {
    "name": "Want to Know the Difference Between a CTO and a VP Engineering?",
    "url": "https://bothsidesofthetable.com/want-to-know-the-difference-between-a-cto-and-a-vp-engineering-4fc3750c596b",
    "description": "Another way to look at thing: placing these roles along the “Process Orientation” and “Technical Capability” quadrants."
  },
  {
    "name": "The different skills needed to be a successful CTO",
    "url": "https://madewithlove.be/one-job-many-roles-the-different-skills-needed-to-be-a-successful-cto/",
    "description": "The premise is a little misleading, as what is detailed there is the journey, in a startup, of the technical founder growing with the company to become a CTO. At which point the position described in the article is not CTO, but VP of Engineering."
  },
  {
    "name": "Hiring a VP of Engineering? Use This Framework",
    "url": "https://review.firstround.com/hiring-a-vp-of-engineering-use-this-framework-from-shopify%27s-vpe-to-get-it-right",
    "description": "“How do I hire a VP of Engineering? After more than 20 years, eight companies, and thousands of hires, I'm starting to suspect this may be the wrong question. A better one is, What is a VP of Engineering?”"
  },
  {
    "name": "“That's usually about the time I nope right out of the interview”",
    "url": "https://news.ycombinator.com/item?id=19188246",
    "description": "Bad signs of a CTO trying to recruit an engineering manager, or the perils of not believing in hierarchies."
  },
  {
    "name": "What are the signs that you have a great manager?",
    "url": "https://news.ycombinator.com/item?id=20230133",
    "description": "“The irony is that you don't really notice a great manager.”"
  },
  {
    "name": "Identify what makes a great manager",
    "url": "https://rework.withgoogle.com/guides/managers-identify-what-makes-a-great-manager/steps/learn-about-googles-manager-research/",
    "description": "Google tried to prove managers don't matter. Instead, it discovered 10 Traits of the Very Best Ones."
  },
  {
    "name": "As a product manager, how do you earn the respect and trust of your team?",
    "url": "https://twitter.com/johncutlefish/status/1124938723093766144"
  },
  {
    "name": "Good Boss, Bad Boss: A Peek Inside the Minds of the Best (and Worst)",
    "url": "https://www.youtube.com/watch?v=lmBSh1FGQyY",
    "description": "A good boss: gets rid of rotten apples (no asshole rule) and protects people from idiocy from on high."
  },
  {
    "name": "source",
    "url": "https://news.ycombinator.com/item?id=19187593",
    "description": "Some tips on how to balance which kind of information needs to be shared or muted."
  },
  {
    "name": "Great PMs don't spend their time on solutions",
    "url": "https://www.intercom.com/blog/great-product-managers-dont-spend-time-on-solutions/",
    "description": "Not on solutions, no. But on customer's problems."
  },
  {
    "name": "Things I have learnt as the software engineering lead of a multinational",
    "url": "https://minnenratta.wordpress.com/2017/01/25/things-i-have-learnt-as-the-software-engineering-lead-of-a-multinational/",
    "description": "Some interesting points here, some others needs to be challenged."
  },
  {
    "name": "Surprising Things About Working at Well-Known Tech Unicorns",
    "url": "https://blog.pragmaticengineer.com/surprising-things-about-working-at-tech-unicorns/",
    "description": "Echoes my own experience on differences between expectations and reality in high growth and visible companies from the point of view of an engineering manager."
  },
  {
    "name": "100+ Lessons Learned for Project Managers",
    "url": "https://llis.nasa.gov/lesson/1956",
    "description": "122 aphorisms providind insights into NASA project management success. Covers design, decision-making, managing staff, working with superiors and contractors."
  },
  {
    "name": "Engineering Manager Resources",
    "url": "https://github.com/ryanburgess/engineer-manager",
    "description": "Huge list, but need some curation."
  },
  {
    "name": "A vitally important part of the job: being a crap shield",
    "url": "https://news.ycombinator.com/item?id=24802483",
    "description": "“A lot of the work of an EM is wading into the slurry pit with a shovel so your team are free to get the job done”."
  },
  {
    "name": "Programmer Moneyball: Challenging the Myth of Individual Programmer Productivity",
    "url": "https://insights.sei.cmu.edu/sei_blog/2020/01/programmer-moneyball-challenging-the-myth-of-individual-programmer-productivity.html",
    "description": "“Since software project managers have limited ability to evaluate individual developer capability, they should rely on a productive environment and developing talent.”"
  },
  {
    "name": "source",
    "url": "https://news.ycombinator.com/item?id=5496914"
  },
  {
    "name": "7 absolute truths I unlearned as junior developer",
    "url": "https://monicalent.com/blog/2019/06/03/absolute-truths-unlearned-as-junior-developer/",
    "description": "“1. I'm a senior developer; 2. Everyone writes tests; 3. We're so far behind everyone else (a.k.a. tech FOMO); 4. Code quality matters most; 5. Everything must be documented; 6. Technical debt is bad; 7. Seniority means being the best at programming”."
  },
  {
    "name": "On Being A Senior Engineer",
    "url": "https://www.kitchensoap.com/2012/10/25/on-being-a-senior-engineer/",
    "description": "“I expect a 'senior' engineer to be a mature engineer.”"
  },
  {
    "name": "Things I Learnt from a Senior Software Engineer",
    "url": "https://neilkakkar.com/things-I-learnt-from-a-senior-dev.html",
    "description": "“I sat next to a senior software engineer for a year. Here's what I learnt.”"
  },
  {
    "name": "5 Things I've Learned in 20 Years of Programming",
    "url": "https://daedtech.com/5-things-ive-learned-in-20-years-of-programming/",
    "description": "“A programmer with 5 years of experienced has more industry tenure than half of the entire industry.” Also see this follow-up comment of 10 things I've learned after 35 years."
  },
  {
    "name": "Devs I really enjoy pairing with",
    "url": "https://twitter.com/ScribblingOn/status/1002598672444448768",
    "description": "“Don't act like know-it-alls; Openly admit if they don't know something; Try to figure stuff out together”."
  },
  {
    "name": "All the best engineering advice I stole from non-technical people",
    "url": "https://medium.com/@bellmar/all-the-best-engineering-advice-i-stole-from-non-technical-people-eb7f90ca2f5f",
    "description": "“It's intriguing that the stuff that really seems to make a difference in the quality of software never seems to be about software.”"
  },
  {
    "name": "What Makes A Great Software Engineer?",
    "url": "https://faculty.washington.edu/ajko/papers/Li2015GreatEngineers.pdf",
    "description": "Doesn't conclude on a definitive answer to the question, but details a model based on 53 attributes (!). Still a good source referencing other papers on the topic."
  },
  {
    "name": "What makes a Senior Dev",
    "url": "https://news.ycombinator.com/item?id=11341567",
    "description": "“Time, man. You gotta do your fucking time.”"
  },
  {
    "name": "The different engineering levels at Google",
    "url": "https://news.ycombinator.com/item?id=24627229",
    "description": "From L3 to L8: a quick description of what makes an engineer at each level."
  },
  {
    "name": "How I operated as a Staff engineer at Heroku",
    "url": "https://amyunger.com/blog/2020/09/10/staff-engineer-at-heroku.html",
    "description": "A great window into the somewhat nebulous title of Staff Engineer, also called Principal Engineer or Software Architect at times. I.e. a role in which you are a technical expert, but know how to solve non-obvious engineering issues, most of the time because they are rooted in social, communications and hierarchical complexities."
  },
  {
    "name": "StaffEng",
    "url": "https://staffeng.com",
    "description": "Once you've reached the Senior Software Engineer level, you're at the crossroad. Either you pursue engineering management or continue down the path of technical excellence to become a Staff Engineer. This isa collection of guides about the later position."
  },
  {
    "name": "10 Admirable Attributes of a Great Technical Lead",
    "url": "https://betterprogramming.pub/10-admirable-attributes-of-a-great-technical-lead-251d13a8843b",
    "description": "“They are smart yet kind. Knowledgeable, yet humble. Busy, yet approachable.”"
  },
  {
    "name": "source",
    "url": "https://news.ycombinator.com/item?id=20786286"
  },
  {
    "name": "source",
    "url": "https://news.ycombinator.com/item?id=21714791"
  },
  {
    "name": "The Prosperous Software Consultant",
    "url": "https://dabit3.medium.com/the-prosperous-software-consultant-5dc8d705c5dd",
    "description": "This article let you understand how an independent consultant operates."
  },
  {
    "name": "Awesome Job Boards",
    "url": "https://github.com/tramcar/awesome-job-boards",
    "description": "Niche job boards by domains, technology, roles and area."
  },
  {
    "name": "Hiring Without Whiteboards",
    "url": "https://github.com/poteto/hiring-without-whiteboards",
    "description": "List of companies without the kind of CS trivia questions that are associated with bad interview practices."
  },
  {
    "name": "Hire people who aren't proven",
    "url": "https://leonardofed.io/blog/startups-hiring.html",
    "description": "If anyone else in the world can objectively assess a candidate to be a great player, then you and your startup won't be able to hire the player. Someone will steal the candidate from you. That's why you have to go after people that aren't proven. In short, you need to be extremely good at forecasting talent."
  },
  {
    "name": "Why I Never Hire Brilliant Men",
    "url": "https://en.wikisource.org/wiki/Why_I_Never_Hire_Brilliant_Men",
    "description": "5 simple rules for hiring men, from 1924. Things haven't changed a lot in a century."
  },
  {
    "name": "A Good Tech Resume",
    "url": "https://thetechresume.com/A_Good_Tech_Resume.pdf",
    "description": "A compilation of advices and example, but containing a good description of a typical hiring pipeline."
  },
  {
    "name": "Job Interviewing Guide",
    "url": "https://www.homerun.co/artofwork/guides/job-interviewing",
    "description": "A detailed description of a hiring process, a great source of inspiration for when your company gets big enough to start to formalize things up."
  },
  {
    "name": "Open Sourced Interview Process",
    "url": "https://github.com/cockroachlabs/open-sourced-interview-process",
    "description": "Cockroach Labs published their process “to create familiarity for candidates and account for bias, resulting in a better candidate experience and hiring decisions.”"
  },
  {
    "name": "Rethinking the Hiring Process",
    "url": "https://www.karllhughes.com/posts/rethinking-hiring",
    "description": "“Testing programmers at something they aren't actually expected to be good at and expecting to learn something about how they would work at your company is delusional, and I think these kind of interviews only serve to make the hiring team feel smarter and ensure better outcomes for engineers with traditional CS backgrounds.”"
  },
  {
    "name": "The Technical Interview is an Ego Trip",
    "url": "https://web.archive.org/web/20221101193146/https://kowsheek.com/the-technical-interview-is-an-ego-trip/",
    "description": "Starts with anecdote of developers using a job interview as a vehicule to demonstrate their superiority. Then the author details a reasonable interview process that is trying to not waste anyone's time."
  },
  {
    "name": "The Intangible Skills You Can't Interview For",
    "url": "https://staysaasy.com/leadership/2021/04/12/the-intangible-skills-you-cant-interview-for.html",
    "description": "“1) Cut-Through on Crappy Tasks; 2) Knowing How to Finish; 3) Knowing How to Start; 4) Giving (And Receiving) Diagonal Feedback; 5) Harnessing the Value of Intangibles.”"
  },
  {
    "name": "Back-End Developer Interview Questions",
    "url": "https://github.com/arialdomartini/Back-End-Developer-Interview-Questions",
    "description": "A great source of inspiration."
  },
  {
    "name": "Engineering Leadership Interviews",
    "url": "https://github.com/kaushikb9/em-interviews",
    "description": "An outline on how to recruit for engineering manager roles."
  },
  {
    "name": "Reverse interview",
    "url": "https://github.com/viraptor/reverse-interview",
    "description": "Questions to ask the company during your interview. Be prepared to answer them as a manager."
  },
  {
    "name": "Culture Queries",
    "url": "https://www.keyvalues.com/culture-queries",
    "description": "A sample of question to ask in job interviews to try to understand the values of a company."
  },
  {
    "name": "Secret manager trick of hiring data scientists",
    "url": "https://twitter.com/kdeldycke/status/1008383946831417344",
    "description": "Convince them that what they're doing is machine learning."
  },
  {
    "name": "Book Summary of \"Who: The A Method for Hiring\"",
    "url": "https://medium.com/mbreads/book-summary-who-c4a437d8ae3a",
    "description": "The essential of Who, a popular book on recruiting executives."
  },
  {
    "name": "source",
    "url": "https://news.ycombinator.com/item?id=13209317",
    "description": "Examples in which developers that might pass tough job interview just fine are bringing negative value later."
  },
  {
    "name": "How to Freaking Find Great Developers By Having Them Read Code",
    "url": "https://web.archive.org/web/20230416055512/https://freakingrectangle.com/2022/04/15/how-to-freaking-hire-great-developers/",
    "description": "“Instead of writing code, consider having the candidate read existing code and talk about how it works. 1) Reading code is 95% of what a developer does as part of their job. 2) A candidate can tell you a lot about their programming skill in the first five minutes of reading. 3) Stress is your enemy because it raises adrenaline which lowers IQ by several points, causing you to miss good candidates.”"
  },
  {
    "name": "Organizational Skills Beat Algorithmic Wizardry",
    "url": "https://prog21.dadgum.com/177.html",
    "description": "“When it comes to writing code, the number one most important skill is how to keep a tangle of features from collapsing under the weight of its own complexity.”"
  },
  {
    "name": "The Horrifically Dystopian World of Software Engineering Interviews",
    "url": "https://web.archive.org/web/20210911031845/https://www.jarednelsen.dev/posts/The-horrifically-dystopian-world-of-software-engineering-interviews",
    "description": "The dark side on relying too much on algorithm challenges."
  },
  {
    "name": "Fizz Buzz Test",
    "url": "https://wiki.c2.com/?FizzBuzzTest",
    "description": "“Designed to help filter out the 99.5% of programming job candidates who can't seem to program their way out of a wet paper bag.”"
  },
  {
    "name": "FizzBuzz 2.0: Pragmatic Programming Questions for Software Engineers",
    "url": "https://web.archive.org/web/20211020130141/https://triplebyte.com/blog/fizzbuzz-2-0-pragmatic-programming-questions-for-software-engineers",
    "description": "Five multiple-choice questions to easily separate the real software engineers from the rest."
  },
  {
    "name": "FizzBuzz Enterprise Edition",
    "url": "https://github.com/EnterpriseQualityCoding/FizzBuzzEnterpriseEdition",
    "description": "A satire of over-engineering for the sake of enterprise-grade software."
  },
  {
    "name": "Awesome Interviews",
    "url": "https://github.com/MaximAbramchuck/awesome-interview-questions",
    "description": "A huge database of questions sorted by topic to get inspiration from."
  },
  {
    "name": "How Not to Bomb Your Offer Negotiation",
    "url": "https://haseebq.com/how-not-to-bomb-your-offer-negotiation/",
    "description": "“A good negotiator is empathetic and collaborative. They don't try to control you or issue ultimatums. Rather, they try to think creatively about how to fulfill both your and their needs.”"
  },
  {
    "name": "How to answer the “What's your current salary?” job interview question",
    "url": "https://web.archive.org/web/20190228034111/https://42hire.com/how-to-answer-the-whats-your-current-salary-job-interview-question-486254cb59ad?gi=a7f878096392",
    "description": "This article explain the dynamic of that sneaky question and how to defuse it."
  },
  {
    "name": "Salary Negotiation: Make More Money, Be More Valued",
    "url": "https://www.kalzumeus.com/2012/01/23/salary-negotiation/",
    "description": "“Your salary negotiation — which routinely takes less than 5 minutes to conclude — has an outsized influence on what your compensation is.”"
  },
  {
    "name": "Ten Rules for Negotiating a Job Offer",
    "url": "https://haseebq.com/my-ten-rules-for-negotiating-a-job-offer/",
    "description": "“First part will be about conceptualizing the negotiating process, about how to begin the process and set yourself up for maximal success. The second part will be advice on the actual back-and-forth portion of negotiating and how to ask for what you want.”"
  },
  {
    "name": "The Most Important Performance Management Rule For Software Engineers",
    "url": "https://staysaasy.com/startups/2022/04/03/performance-management.html",
    "description": "“Merge code every week. That's what you should be saying to your new Software Engineering hire.”"
  },
  {
    "name": "Optimize Onboarding",
    "url": "https://staysaasy.com/management/2020/08/28/Optimize-Onboarding.html",
    "description": "“Your organization has painfully slow onboarding. Endless HR videos, slow security processes, a mountain of fragile technology setup - these all make for a shitty and counterproductive start at a company. Optimize your onboarding to get people doing what you hired them to do.”"
  },
  {
    "name": "As a manager of a new employee I make an absolute point of being a \"helicopter mom\" from the moment they hit the area until about week 2 or 3",
    "url": "https://news.ycombinator.com/item?id=24404676",
    "description": "Navigating a new organization will be hard the first few weeks, and the presence of a manager can help speed things up."
  },
  {
    "name": "A Career Cold Start Algorithm",
    "url": "https://boz.com/articles/career-cold-start",
    "description": "The author developed an algorithm to ramp-up quickly when joining an existing team where he had a massive knowledge deficit and no pre-existing relationships."
  },
  {
    "name": "Meeting everyone on a new team",
    "url": "https://www.annashipman.co.uk/jfdi/meeting-everyone.html",
    "description": "Right after inheriting a position at the top of an organization of 50 engineers, the author bootstraped the relationship with that big team by meeting everyone in 30 minutes 1:1s. It was a huge time investment, and despite fears of being boring, it allows for recognizing patterns of what change was needed."
  },
  {
    "name": "Drive: The surprising truth about what motivates us",
    "url": "https://www.youtube.com/watch?v=u6XAPnuFjJc",
    "description": "Daniel Pink summarizes it concisely: people are motivated by autonomy, mastery and purpose."
  },
  {
    "name": "Bryan Cantrill defines that the role of management",
    "url": "https://twitter.com/bcantrill/status/1216491615264489473?s=20"
  },
  {
    "name": "What Silicon Valley \"Gets\" about Software Engineers that Traditional Companies Do Not",
    "url": "https://blog.pragmaticengineer.com/what-silicon-valley-gets-right-on-software-engineers/",
    "description": "“1. Autonomy for software engineers; 2. Curious problem solvers, not mindless resources; 3. Internal data, code, and documentation transparency; 4. Exposure to the business and to business metrics; 5. Engineer-to-engineer comms over triangle-communication; 6. Investing in a less frustrating developer experience; 7. Higher leverage --> higher {autonomy, pay}”."
  },
  {
    "name": "Some reasons why enterprise software is good and maybe even fun",
    "url": "https://news.ycombinator.com/item?id=21231455",
    "description": "The majority of us will not build the next unicorn: we statically have a better chance to build enterprise software. The twist? It might even be more interesting than you expect."
  },
  {
    "name": "First, Break All the Rules: What the World's Greatest Managers Do Differently",
    "url": "https://www.amazon.com/dp/1595621113?&linkCode=ll1&tag=kevideld-20&linkId=cc8ac8de84cb23f23ca5577dcb7af139&language=en_US&ref_=as_li_ss_tl",
    "description": "We learn in this book that employee happiness was not correlated to company success. A comment on HN details the questions that were highly correlated to company success."
  },
  {
    "name": "What makes developers happy? Contributing to open source",
    "url": "https://www.techrepublic.com/article/what-makes-developers-happy-contributing-to-open-source/",
    "description": "“59% of developers contribute to open source software today. Why do they contribute? The top two reasons are: To improve coding skills and because they believe in open source. Want to keep those developers happy and employed with you? Let them contribute.”"
  },
  {
    "name": "source",
    "url": "https://twitter.com/dwc/status/962179099606200320",
    "description": "Maybe the best indicator of a happy team is how little it is disturbed outside office hours."
  },
  {
    "name": "6 Signs You're a Micromanager (And What to Do Instead)",
    "url": "https://unito.io/blog/micromanagement-signs/",
    "description": "“You're more involved with your employees than ever, yet they seem disgruntled, unhappy, and less productive than usual. Your check-ins seem to go unappreciated. And no one seems receptive to all of your great feedback on their work. What's going on? Well, we hate to break it to you, but you might be a micromanager.”"
  },
  {
    "name": "3 tricks to start working despite not feeling like it",
    "url": "https://www.deprocrastination.co/blog/3-tricks-to-start-working-despite-not-feeling-like-it",
    "description": "“'Screw it, let's do it'; Start sloppy; Start small”."
  },
  {
    "name": "Why procrastination is about managing emotions, not time",
    "url": "https://www.bbc.com/worklife/article/20200121-why-procrastination-is-about-managing-emotions-not-time",
    "description": "“Research shows that once the first step is made towards a task, following through becomes easier”."
  },
  {
    "name": "hacker-laws",
    "url": "https://github.com/dwmkerr/hacker-laws",
    "description": "Laws, Theories, Principles and Patterns that developers will find useful."
  },
  {
    "name": "Adaptation vs adaptability",
    "url": "https://sci-hub.st/10.1016/s0303-2647%2801%2900170-8",
    "description": "There is a spectrum between perfect efficiency and being completely flexible. This article explores ecosystems and the flows of material and energy between different organisms within the ecosystem. (hinted by HN comment)"
  },
  {
    "name": "The IT revolution and southern Europe's two lost decades",
    "url": "https://voxeu.org/article/it-revolution-and-southern-europes-two-lost-decades",
    "description": "If you still doubt management culture could make or break an industry: “inefficient management practices have kept southern European firms from taking full advantage of the IT revolution”."
  },
  {
    "name": "Meaningful differences that makes Google offices more productive",
    "url": "https://news.ycombinator.com/item?id=20443133",
    "description": "“The people are smarter, your manager (and their manager) cares a lot about you and it's easy to move.”"
  },
  {
    "name": "It's Not Enough to Be Right—You Also Have to Be Kind",
    "url": "https://forge.medium.com/its-not-enough-to-be-right-you-also-have-to-be-kind-b8814111fe1",
    "description": "“It's harder to be kind than clever”, or put another way by Abraham Joshua Heschel: “When I was young, I used to admire intelligent people; as I grow older, I admire kind people.”"
  },
  {
    "name": "source",
    "url": "https://news.ycombinator.com/item?id=7179946"
  },
  {
    "name": "source",
    "url": "https://news.ycombinator.com/item?id=20914779",
    "description": "At one point, even with the most unselfish of intentions, your attempts to elevate the culture might stall. It is not fair, but it's probably the time to leave."
  },
  {
    "name": "You have only 4 options",
    "url": "https://news.ycombinator.com/item?id=16126082",
    "description": "“1. Change you; 2. Change the other; 3. Fly; 4. Stay and suffer.” A more concise way of saying the same thing as above."
  },
  {
    "name": "Netflix Culture",
    "url": "https://www.slideshare.net/reed2001/culture-1798664",
    "description": "“The actual company values, as opposed to the nice-sounding values, are shown by who gets rewarded, promoted, or let go.”"
  },
  {
    "name": "High Performance Organizations Reading List",
    "url": "https://github.com/pdfernhout/High-Performance-Organizations-Reading-List",
    "description": "A list of books, web pages, and videos about how to design better organizations, divided into 3 categories: organization and motivation, health and wellness, and software development specific."
  },
  {
    "name": "A Conversation with Werner Vogels, Learning from the Amazon technology platform",
    "url": "https://queue.acm.org/detail.cfm?id=1142065",
    "description": "Scaling systems is not only a technical challenge. It has to be about teams and culture too. One lesson learned from the early days of AWS: “Giving developers operational responsibilities has greatly enhanced the quality of the services, both from a customer and a technology point of view. (…) You build it, you run it.”"
  },
  {
    "name": "The principles of Amazon service-oriented collaboration",
    "url": "https://www.theregister.com/2019/05/14/amazons_away_teams/?page=2",
    "description": "A compilation of anonymous sources from AWS which ehoes the interview above: “teams are ostensibly autonomous and can make any important decision needed to meet their goals.”"
  },
  {
    "name": "Gigerenzer's simple rules",
    "url": "https://www.foundingfuel.com/article/gigerenzers-simple-rules/",
    "description": "The reason we often relies on these simple heuristics: “outside the lab, in real world, we cannot do well with just with logical rationality, we need ecological rationality - the kind of thinking that helps us get what we want in an environment that's uncertain and dynamic. This means exercising our instincts, using simple but robust rules of thumb.”"
  },
  {
    "name": "The Best Way to Make Intelligent Decisions",
    "url": "https://fs.blog/mental-models/#military_and_war",
    "description": "A collection of 109 models."
  },
  {
    "name": "Mental Models I Find Repeatedly Useful",
    "url": "https://medium.com/@yegg/mental-models-i-find-repeatedly-useful-936f1cc405d#.qb3gkdmtk",
    "description": "Huge compiled list of mental models. Became the basis of book."
  },
  {
    "name": "40 powerful concepts for understanding the world",
    "url": "https://twitter.com/G_S_Bhogal/status/1225561131122597896",
    "description": "Concepts are named and describe succinctly in the tweet thread."
  },
  {
    "name": "Tools for better thinking",
    "url": "https://untools.co",
    "description": "“Collection of thinking tools and frameworks to help you solve problems, make decisions and understand systems.”"
  },
  {
    "name": "A Few Rules",
    "url": "https://www.collaborativefund.com/blog/a-few-rules/",
    "description": "A formalized list of some wisdom you probably encountered elsewhere."
  },
  {
    "name": "Awesome Concepts",
    "url": "https://github.com/lukasz-madon/awesome-concepts",
    "description": "Laws, principles, mental models and cognitive biases."
  },
  {
    "name": "UX Core",
    "url": "https://keepsimple.io/uxcore",
    "description": "105 cognitive biases with simple descriptions, brief and detailed examples."
  },
  {
    "name": "Hanlon's razor",
    "url": "https://en.wikipedia.org/wiki/Hanlon%27s_razor",
    "description": "“Never attribute to malice that which is adequately explained by stupidity.” My favorite flavor of Occam's Razor, and a crucial mantra to defuse rampant paranoia in a highly political setting."
  },
  {
    "name": "Regression toward the mean",
    "url": "https://en.wikipedia.org/wiki/Regression_toward_the_mean",
    "description": "Or why after a period of intense euphoria and ambition, things slowly get back to their usual mediocrity."
  },
  {
    "name": "Locus of control",
    "url": "https://en.wikipedia.org/wiki/Locus_of_control",
    "description": "A framework on “the degree to which people believe that they have control over the outcome of events in their lives, as opposed to external forces beyond their control.”"
  },
  {
    "name": "First principles and asking why",
    "url": "https://www.theengineeringmanager.com/growth/first-principles-and-asking-why/",
    "description": "“Our ability to think in abstractions can weaken our judgement, as those abstractions may no longer be as true as they once were. Also a similarly dangerous evolutionary trait is our ability to think in analogy, where we make assumptions based on the comparison of two things that are not actually related.” Elon Musk explains it better."
  },
  {
    "name": "from a panel on the Moral Economy of Tech",
    "url": "https://idlewords.com/talks/sase_panel.htm",
    "description": "A reminder of the needs of humility and recognition of limits in our industry, from a panel on the Moral Economy of Tech."
  },
  {
    "name": "The Art of Powerful Questions - Catalyzing Insight, Innovation, and Action",
    "url": "https://umanitoba.ca/admin/human_resources/change/media/the-art-of-powerful-questions.pdf",
    "description": "Catalyzing Insight, Innovation, and Action - “Leaders believe that they are being paid for fixing problems rather than for fostering breakthrough thinking.”"
  },
  {
    "name": "To Get Good, Go After The Metagame",
    "url": "https://commoncog.com/blog/to-get-good-go-after-the-metagame/",
    "description": "“Every sufficiently interesting game has a metagame above it. This is the game about the game. It is often called 'the meta'. (…) The meta is what you get after you master boring fundamentals. But observing the state of the current meta often reveals what boring fundamentals you need to learn.”"
  },
  {
    "name": "Yes, and…",
    "url": "https://en.wikipedia.org/wiki/Yes,_and...",
    "description": "“A rule-of-thumb in improvisational comedy (…). It is also used in business and other organizations as a principle that improves the effectiveness of the brainstorming process, fosters effective communication, and encourages the free sharing of ideas.”"
  },
  {
    "name": "Strong Opinions, Weakly Held — a framework for thinking",
    "url": "https://medium.com/@ameet/strong-opinions-weakly-held-a-framework-for-thinking-6530d417e364",
    "description": "“Allow your intuition to guide you to a conclusion, no matter how imperfect — this is the 'strong opinion' part. Then – and this is the 'weakly held' part – prove yourself wrong.”"
  },
  {
    "name": "Disney's Frozen",
    "url": "https://i.pinimg.com/originals/b5/17/97/b5179700050b96f91f63e086e053b5ee.jpg",
    "description": "Disney's Frozen."
  },
  {
    "name": "I coached CEOs, founders, VCs and other executive: These are the biggest takeaways",
    "url": "https://leowid.com/2019-2",
    "description": "Excerpt: “We're all just big, complicated bags of emotion walking around; Power comes with the ability to receive a No; Learning to manage your focus, not your time.”"
  },
  {
    "name": "Intellectual Humility Cheat Sheet",
    "url": "https://web.archive.org/web/20200526135036/https://images.squarespace-cdn.com/content/v1/53419b80e4b0cccdfc3bbcf8/1579371627532-SANUEQ1REPX09L8NE1XM/ke17ZwdGBToddI8pDm48kI9Q46LYBJG1wKj9b7EvhSB7gQa3H78H3Y0txjaiv_0fDoOvxcdMmMKkDsyUqMSsMWxHk725yiiHCCLfrh8O1z5QHyNOqBUUEtDDsRWrJLTmWp-RWlGnWD_Yv5axNBE_gjfhPXbI2t7MOi3WVleCqN9URFC-c33mY-I6dtTBVWXC/ih-cheat-sheet-v2.jpg",
    "description": "“is about being open and able to change your mind about important things, and being able to discern when you should.”"
  },
  {
    "name": "Avoiding Intellectual Phase Lock",
    "url": "https://books.google.com/books?id=__CnDwAAQBAJ&lpg=PT21&dq=intellectual%20phase%20lock%20Frank%20Dunnington&pg=PT21#v=onepage&q=intellectual%20phase%20lock%20Frank%20Dunnington&f=false",
    "description": "Anticipating an important result so much, humans by nature are susceptible to introduce subtle confirmation bias. To combat IPL, you might introduce random unknowns to suppress any attempt to game the system toward the object of your desire. I.e. avoid to cheat yourself to success."
  },
  {
    "name": "The six ways to influence people",
    "url": "https://www.bakadesuyo.com/2013/06/robert-cialdini-influence/",
    "description": "6 universal principles of influence that are used to persuade business professionals: reciprocity, consistency, social proof, getting people to like you, authority and scarcity."
  },
  {
    "name": "On Bullshit",
    "url": "http://ruby.fgcu.edu/courses/twimberley/EnviroPhilo/bullshit.pdf",
    "description": "This HN comment perfectly describes the concept. “Unlike lying/fraud, where falsehood is instrumental, Frankfurt defined bullshit as potentially false speech where the truth simply wasn't important. Bullshit is characterized by giving the surface appearance of confidence, intelligence, or a convincing argument; whether it's actually true or not is besides the point.”"
  },
  {
    "name": "How to Celebrate the Small Wins",
    "url": "https://medium.dave-bailey.com/how-to-celebrate-the-small-wins-4a03004a1816",
    "description": "My takeaway: “Celebrating Slow Progress; Hunt for Key Milestones”."
  },
  {
    "name": "Team Leader Venn Diagram",
    "url": "https://larahogan.me/blog/team-leader-venn-diagram/",
    "description": "“A tool for gaining a shared understanding of responsibilities”."
  },
  {
    "name": "When your coworker does great work, tell their manager",
    "url": "https://jvns.ca/blog/2020/07/14/when-your-coworker-does-great-work-tell-their-manager/",
    "description": "Highlighting unseen work in public allows managers to recognize efforts their reports are doing. Still, there is some cases in which it might put your collegue in a tight spot. So always ask if it's ok first."
  },
  {
    "name": "Eye Candy QA",
    "url": "https://techreflect.net/2020/01/05/eye-candy-qa-2005-2011/",
    "description": "Retelling of author's job at Apple: “John Louch was my boss. (…) John always shared everything with us, even the don't share this with your team stuff. We were people he trusted, so it was as it should be. It made you feel like you were part of something greater.” Or why sharing some open secret promote strong trust in your entourage."
  },
  {
    "name": "A conversation with Elon Musk about Starship",
    "url": "https://youtu.be/cIQ36Kt7UVg?t=203",
    "description": "In a team with very talented contributors, everyone's is a chief engineer: you are expected to challenge the status-quo and questions other department's constraints. This allow smart engineers to avoid the trap of optimizing for something that should not exist in the first place."
  },
  {
    "name": "Symptoms of Groupthink",
    "url": "https://web.archive.org/web/20210925184712/https://courses.washington.edu/psii101/Powerpoints/Symptoms%20of%20Groupthink.htm",
    "description": "Overconfidence, tunnel vision and conformity pressure can led a group astray."
  },
  {
    "name": "It's Not Sabotage, They're Drowning",
    "url": "https://shermanonsoftware.com/2019/11/15/its-not-sabotage-theyre-drowning/",
    "description": "Some kind of push backs shouldn't be interpreted as intentional sabotage, but as drowning people sinking the lifeboat in an attempt to save themselves."
  },
  {
    "name": "source",
    "url": "https://news.ycombinator.com/item?id=21828666",
    "description": "Or why trying to create a community from the ground up might not be the right way of looking at things: a better and more subtle strategy would be to empowers the already existing channels and make them visible."
  },
  {
    "name": "OpenTeams",
    "url": "https://openteam.info",
    "description": "“Teams can visualize their network of interactions, and also, cross this data with information on a teams demographic, professional, and psychological characteristics.” As manager, make sure these metrics bring positive outcome to the team. It is easy to have them instrumentalized for political reasons."
  },
  {
    "name": "Do engineering managers need to be technical?",
    "url": "https://increment.com/teams/do-engineering-managers-need-to-be-technical/",
    "description": "Yes. “Looking forward to the next 30 years of management trends, only a few things seem certain: Managers should be technical, and the definition of technical will continue to change.”"
  },
  {
    "name": "If Your Boss Could Do Your Job, You're More Likely to Be Happy at Work",
    "url": "https://hbr.org/2016/12/if-your-boss-could-do-your-job-youre-more-likely-to-be-happy-at-work",
    "description": "“Although we found that many factors can matter for happiness at work – type of occupation, level of education, tenure, and industry are also significant, for instance – they don't even come close to mattering as much as the boss' technical competence.”"
  },
  {
    "name": "source",
    "url": "https://news.ycombinator.com/item?id=23891984",
    "description": "Another way of putting it: managers needs domain knowledge and to know the work their reports do."
  },
  {
    "name": "source",
    "url": "https://news.ycombinator.com/item?id=20683609",
    "description": "This quote is from David Packard (HP co-founder), decades before current management fad."
  },
  {
    "name": "Second-system effect",
    "url": "https://en.wikipedia.org/wiki/Second-system_effect",
    "description": "“Tendency of small, elegant, and successful systems, to be succeeded by over-engineered, bloated systems”."
  },
  {
    "name": "Living with Complexity, by Donald A. Norman",
    "url": "https://www.amazon.com/Living-Complexity-Donald-Norman-2010/dp/B00DEKM5GK?_encoding=UTF8&qid=1686404524&sr=1-1&linkCode=ll1&tag=kevideld-20&linkId=497ae387bbd398624d897bdfbf90f7b6&language=en_US&ref_=as_li_ss_tl",
    "description": "In which we learn that, based on Tesler's law of the conservation of complexity, “the total complexity of a system is a constant: as you make the person's interaction simpler, the hidden complexity behind the scenes increases. Make one part of the system simpler, said Tesler, and the rest of the system gets more complex.”"
  },
  {
    "name": "The Efficiency-Destroying Magic of Tidying Up",
    "url": "https://flocrivello.com/the-efficiency-destroying-magic-of-tidying-up/",
    "description": "“Efficiency tends to look messy, and good looks tend to be inefficient.” A reminder that sometimes we should just accept the messiness of the world."
  },
  {
    "name": "I try to optimize my code around reducing state, coupling, complexity and code, in that order",
    "url": "https://news.ycombinator.com/item?id=11042400",
    "description": "An engineer's perspective on which priorities should be addressed first to increase robustness of systems."
  },
  {
    "name": "SpaceX's 5-Step design and manufacturing process",
    "url": "https://www.youtube.com/watch?v=t705r8ICkRw&t=13m30s",
    "description": "“1. Make requirement less dumb; 2. Try to delete parts; 3. Simplify or optimize; 4. Accelerate cycle time; 5. Automate”. See full transcript."
  },
  {
    "name": "Choose Boring Technology",
    "url": "http://boringtechnology.club",
    "description": "“Boring, in the sense that it's well understood.”"
  },
  {
    "name": "Choose Well-known Technology",
    "url": "https://news.ycombinator.com/item?id=23445535",
    "description": "A rephrasing of the above advice. “Choose the technology: 1. You know in and out, and are immediately productive with; 2. Which is sure to be around in 5-7 years, preferably 10-15; 3. For which you are comfortable hiring the next 15 engineers.”"
  },
  {
    "name": "Industry Data Models",
    "url": "http://www.databaseanswers.org/data_models/",
    "description": "A huge list of database templates to represent any business process."
  },
  {
    "name": "I thought that using loops was cheating…",
    "url": "https://www.facebook.com/spliceofficial/photos/a.555206991212765/679408552125941/?type=1&theater",
    "description": "How much is too much? Libraries, whether software or audio loops, are tools. A typical case of NIH syndrome transposed to music production."
  },
  {
    "name": "There's a third direction you can go, I call it going deep.",
    "url": "https://news.ycombinator.com/item?id=8902739",
    "description": "throw hardware at the problem, on a single machine. Wide - add more machines. There's a third direction you can go, I call it going deep.”"
  },
  {
    "name": "You need to be this tall to use (micro) services",
    "url": "https://news.ycombinator.com/item?id=12509533",
    "description": "Do not chase the hype. Yet. Micro-services only brings value past a certain infrastructure and organization size. This is a list of stuff you should focus on before bringing micro-services to the mix."
  },
  {
    "name": "LEGO blocks and organ transplants",
    "url": "https://www.johndcook.com/blog/2011/02/03/lego-blocks-and-organ-transplants/",
    "description": "“People have been comparing software components to LEGO blocks for a couple decades. (…) Integrating two software systems is usually more like performing a heart transplant than snapping together LEGO blocks.”"
  },
  {
    "name": "source",
    "url": "https://accu.org/bookreviews/1998/kloss_1668/",
    "description": "This quote is from a review of Superdistribution - Objects as Property on the Electronic Frontier, in which the creator of Objective-C was advocating in the 90's for a new economic framework that rewards creation of components in proportion to their use. But software production is not like manufacturing of widgets in a factory. A (software) object is not an (hardware) widget."
  },
  {
    "name": "Software Engineering's Greatest Hits",
    "url": "https://www.youtube.com/watch?v=HrVtA-ue-x0",
    "description": "When scientific method meet the practice of software development. My takeaways: the best metric is less lines of code, there is no 10x developers, too much unused configuration options, pair programing is for transfer of domain-specific knowledge and hackathon don't produce long term projects."
  },
  {
    "name": "Code reviews at Google",
    "url": "https://github.com/google/eng-practices/blob/master/review/reviewer/speed.md#why-should-code-reviews-be-fast-why",
    "description": "“Why Should Code Reviews Be Fast? (…) To optimize for the speed at which a team of developers can produce a product together, as opposed to optimizing for the speed at which an individual developer can write code.”"
  },
  {
    "name": "Google Engineering Practices",
    "url": "https://google.github.io/eng-practices/",
    "description": "Explains how to perform code reviews and how to submit them."
  },
  {
    "name": "Embedded Rules of Thumb",
    "url": "https://embeddedartistry.com/blog/2018/04/26/embedded-rules-of-thumb/",
    "description": "Guidelines and heuristics to provide a reasonable approximation of the truth while developing embedded devices. Most also applies to software projects in general."
  },
  {
    "name": "How to Misuse Code Coverage",
    "url": "https://web.archive.org/web/20180508120159/http://www.testingeducation.org/BBST/foundations/Marick_coverage.pdf",
    "description": "“If a part of your test suite is weak in a way that coverage can detect, it's likely also weak in a way coverage can't detect.” I.e. the great benefit of a coverage report is that it tells you what you forgot to think about when you wrote the test suite itself (source)."
  },
  {
    "name": "Tech Due Diligence Calculator",
    "url": "https://decodingvc.gitbooks.io/p9-startup-tech-due-diligence-calculator/content/",
    "description": "A list of questions by topic to help understand how you are building your tech and engineering team, trying to highlight red flags."
  },
  {
    "name": "Technical Debt Is Like Tetris",
    "url": "https://medium.com/s/story/technical-debt-is-like-tetris-168f64d8b700",
    "description": "Another way to explain technical debt: “Scenarios like these create technical debt within the product code. A buried gap in Tetris represents technical debt. (…) Paying down technical debt keeps you competitive. It keeps you in the game.”"
  },
  {
    "name": "Technical debt as a lack of understanding",
    "url": "https://daverupert.com/2020/11/technical-debt-as-a-lack-of-understanding/",
    "description": "“The problem lies in \"never reorganizing [the code] to reflect your understanding.\" (…) Organizationally, you pay in velocity and turnover; talented people are going to leave after a few rounds of bullshit.”"
  },
  {
    "name": "The Framing of the Developer",
    "url": "https://www.amazingcto.com/develop-for-impact-not-for-backlog/",
    "description": "Default framing is around the backlog, which leads to an asymmetry in which failure is blamed on lacks of developer performance, and success is celebrated as the full realization of the PM's vision. But “technology is the bank that gave credit”, and technical debt should be called product debt “because product took the credit to get a feature faster and must pay back by investing the time to clean up.” The alternative? “Companies today need a frame of impact. In this world-view success is defined by impact.”"
  },
  {
    "name": "Goodbye, Clean Code",
    "url": "https://overreacted.io/goodbye-clean-code/",
    "description": "“My boss invited me for a one-on-one chat where they politely asked me to revert my change. I was aghast. The old code was a mess, and mine was clean! (…) I see now that my 'refactoring' was a disaster in two ways: I didn't talk to the person who wrote it; My code traded the ability to change requirements for reduced duplication”."
  },
  {
    "name": "The Surprising Traits of Good Remote Leaders",
    "url": "https://www.bbc.com/worklife/article/20200827-why-in-person-leaders-may-not-be-the-best-virtual-ones",
    "description": "“the confidence, intelligence and extroversion that have long propelled ambitious workers into the executive suite are not enough online because they simply don't translate into virtual leadership. (…) Instead, workers who are organized, dependable and productive take the reins of virtual teams.” As the source paper say it best: “virtually, the emphasis shifts from saying to doing.”"
  },
  {
    "name": "Things to look for when hiring remote workers",
    "url": "https://news.ycombinator.com/item?id=17022563",
    "description": "“1. You have to adhere to employment laws within the country you're hiring from; 2. To employ someone full time, many countries require you to have a legally entity within that country; 3. Prioritize countries where we have the most interest; 4. Keep a healthy timezone overlap in each of our teams.”"
  },
  {
    "name": "Managing Remote Teams - A Crash Course",
    "url": "http://klinger.io/post/180989912140/managing-remote-teams-a-crash-course",
    "description": "A Crash Course - Compilation of easy rules and processes to bootstrap a remote team."
  },
  {
    "name": "GitLab's Guide to All-Remote",
    "url": "https://about.gitlab.com/company/culture/all-remote/guide/",
    "description": "“GitLab is the world's largest all-remote company”. Here is what it means and how it works."
  },
  {
    "name": "Asynchronous Communication: The Real Reason Remote Workers Are More Productive",
    "url": "https://doist.com/blog/asynchronous-communication/",
    "description": "“Remote workers are more productive than their office-bound counterparts.”"
  },
  {
    "name": "A guide to distributed teams",
    "url": "https://increment.com/teams/a-guide-to-distributed-teams/",
    "description": "A nice wrap up on the numerous dispositions required to have a highly effective distributed team."
  },
  {
    "name": "Awesome Remote Job",
    "url": "https://github.com/lukasz-madon/awesome-remote-job",
    "description": "Resources on working remotely, including job boards, coworking spaces, and a list of companies embracing the culture."
  },
  {
    "name": "Dear Manager, You're Holding Too Many Meetings",
    "url": "https://hbr.org/2022/03/dear-manager-youre-holding-too-many-meetings",
    "description": "“Employee productivity was 71% higher when meetings were reduced by 40%. This is largely because employees felt more empowered and autonomous. Rather than a schedule being the boss, they owned their to-do lists and held themselves accountable.”"
  },
  {
    "name": "How to have great meetings, according to 200 scientific studies",
    "url": "https://qz.com/work/1713662/how-to-have-great-meetings-according-to-200-scientific-studies/",
    "description": "A roadmap for getting meetings right."
  },
  {
    "name": "Wadge's Law (of Meetings)",
    "url": "https://billwadge.wordpress.com/2019/03/24/laws-of-the-universe-and-teaching/",
    "description": "“Before every formal meeting there's a smaller, more exclusive, less formal meeting where all the important decisions are made.”"
  },
  {
    "name": "source",
    "url": "https://news.ycombinator.com/item?id=22341739",
    "description": "Another advice from the source: make them walk'n'talks."
  },
  {
    "name": "Questions for our first 1:1",
    "url": "https://larahogan.me/blog/first-one-on-one-questions/",
    "description": "A personal list of high-level questions from a manager."
  },
  {
    "name": "1 on 1 Meeting Questions",
    "url": "https://github.com/VGraupera/1on1-questions",
    "description": "A mega list in which most of them are great starters for conversation, some others are clearly bad ideas. A great source of inspiration nonetheless, but choose carefully."
  },
  {
    "name": "Your daily standups should be async. Here's why",
    "url": "https://web.archive.org/web/20200515171636/https://www.cadencework.com/blog/async-standups.html",
    "description": "“Daily, real-time meetings aren't practical for remote teams” might be the best practical reason."
  },
  {
    "name": "The Good, the Bad and the Ugly Standup",
    "url": "https://kristoff.it/blog/good-bad-ugly-standup/",
    "description": "Author experienced 3 formats of stand-ups before ending with one working for his team, and concludes that “the details that make up a good meeting are subtle and the pursuit of an artificial standard of aesthetics will prevent you from doing the necessary experimentation to improve from an ugly equilibrium”."
  },
  {
    "name": "We Cancelled Standups and Let The Team Build. Here's What Happened…",
    "url": "https://www.usehaystack.io/blog/we-cancelled-standups-and-let-the-team-build-heres-what-happened",
    "description": "Team felt burned out by long, daily status update meetings masquerading as standups. Eliminating these faux standups got the team back on track."
  },
  {
    "name": "The impact of the 'open' workspace on human collaboration",
    "url": "https://sci-hub.st/https://royalsocietypublishing.org/doi/full/10.1098/rstb.2017.0239",
    "description": "Open-plan offices decrease face-to-face collaboration."
  },
  {
    "name": "Noise, Cognitive Function, and Worker Productivity",
    "url": "https://joshuatdean.com/wp-content/uploads/2020/02/NoiseCognitiveFunctionandWorkerProductivity.pdf",
    "description": "“An increase of 10 dB reduces productivity by approximately 5%.”"
  },
  {
    "name": "The Elves Leave Middle Earth – Sodas Are No Longer Free",
    "url": "https://steveblank.com/2009/12/21/the-elves-leave-middle-earth-%E2%80%93-soda%E2%80%99s-are-no-longer-free/",
    "description": "Company stopped providing free soda. The engineers were very upset, but it was just soda and they could afford it. But really it wasn't soda. Soda was the canary in the coal mine, triggering an exodus of its best engineers."
  },
  {
    "name": "source",
    "url": "https://news.ycombinator.com/item?id=19050555"
  },
  {
    "name": "Awesome Product Management",
    "url": "https://github.com/dend/awesome-product-management",
    "description": "A reference. All the missing pieces are found below."
  },
  {
    "name": "Principles for Great Product Managers",
    "url": "https://reeve.blog/blog/principles/",
    "description": "A concise wrap-up of all dimensions a PM oprates along."
  },
  {
    "name": "Open Product Management",
    "url": "https://github.com/tron1991/open-product-management",
    "description": "Resources, interviews, case studies, sample products & projects, communities, open source tools, free & paid services on product management, for technical people to learn the field."
  },
  {
    "name": "Things Many People Find Too Obvious To Have Told You Already",
    "url": "https://twitter.com/patio11/status/936615043126370306",
    "description": "A set of heuristics on tech companies and the ecosystem they live in."
  },
  {
    "name": "The Heilmeier Catechism",
    "url": "https://www.darpa.mil/work-with-us/heilmeier-catechism",
    "description": "A simple set of question which helped DARPA evaluates research programs to generate big rewards by taking big risks."
  },
  {
    "name": "Akin's Laws of Spacecraft Design",
    "url": "https://spacecraft.ssl.umd.edu/akins_laws.html",
    "description": "Lots of wisdom about space program management."
  },
  {
    "name": "How to exit vim, the Product Manager way",
    "url": "https://github.com/hakluke/how-to-exit-vim/blob/master/README.md#the-product-manager-way",
    "description": "A satire with a grain of truth, especially the comparison between the basic vs experienced level."
  },
  {
    "name": "What Everybody Ought To Know About The Product Manager Case Interview",
    "url": "http://www.venturegrit.com/what-everybody-ought-to-know-about-the-product-manager-case-interview/"
  },
  {
    "name": "What are frequently asked questions in product manager interviews?",
    "url": "https://www.quora.com/What-are-frequently-asked-questions-in-product-manager-interviews"
  },
  {
    "name": "I wasted $40k on a fantastic startup idea",
    "url": "https://tjcx.me/posts/i-wasted-40k-on-a-fantastic-startup-idea/",
    "description": "A tale of building a product no user want to pay for. “You can't just create value for the user: that's a charity. You also can't just create value for your company: that's a scam. Your goal is to set up some kind of positive-sum exchange, where everyone benefits, including you. A business plan, according to this textbook, starts with this simple question: how will you create value for yourself and the company?”"
  },
  {
    "name": "David Rusenko - How To Find Product Market Fit",
    "url": "https://www.youtube.com/watch?v=0LNQxT9LvM0",
    "description": "How To Find Product Market Fit - “Details the story of how Weebly developed one of the most popular website creation and hosting sites on the web today.”"
  },
  {
    "name": "Fundamentals of Product-Market Fit",
    "url": "https://www.holloway.com/s/rvc-fundamentals-of-product-market-fit",
    "description": "A complete overview of the concept: what is product-market fit and to measuring it."
  },
  {
    "name": "Sustainable Sources of Competitive Advantage",
    "url": "https://www.collaborativefund.com/blog/sustainable-sources-of-competitive-advantage/",
    "description": "“The ability to learn faster than your competition; to empathize with customers more than your competition; to communicate more effectively than your competition; The willingness to fail more than your competition; to wait longer than your competition”."
  },
  {
    "name": "Coglode: bite-size behavioral research analysis",
    "url": "https://www.coglode.com",
    "description": "Mostly applied behaviour insights to help you build up strategies and tactics on product, design and planning."
  },
  {
    "name": "“Why does the tire company rate restaurants”",
    "url": "https://mobile.twitter.com/trevmckendrick/status/1218748974321954816",
    "description": "A great example on why you should investigate complementary businesses."
  },
  {
    "name": "Laws of Tech: Commoditize Your Complement",
    "url": "https://www.gwern.net/Complement",
    "description": "A step further from the previous advice, in which is detailed an aggressive strategy to consolidate monopolies."
  },
  {
    "name": "sacrificial lamb product",
    "url": "https://twitter.com/SwiftOnSecurity/status/851861076429991937"
  },
  {
    "name": "the #1 bug predictor is not technical, it's organizational complexity",
    "url": "https://augustl.com/blog/2019/best_bug_predictor_is_organizational_complexity/"
  },
  {
    "name": "Osborne effect",
    "url": "https://en.wikipedia.org/wiki/Osborne_effect",
    "description": "“A social phenomenon of customers canceling or deferring orders for the current soon-to-be-obsolete product as an unexpected drawback of a company's announcing a future product prematurely.” This is the price to pay for hasty marketing actions."
  },
  {
    "name": "Reverse Engineering A Successful Lifestyle Business",
    "url": "https://web.archive.org/web/20230129184848/http://www.toomas.net/2017/07/18/reverse-engineering-a-successful-lifestyle-business-heres-everything-ive-learned-from-reading-indiehackers-com/",
    "description": "Targets lifestyle entrepreneur, but still full of fantastic quotes from reference books on customer relation, pricing and marketing a product."
  },
  {
    "name": "The Atlassian Syndrome",
    "url": "https://twitter.com/maikzumstrull/status/1309497246946406400",
    "description": "Your organization will end up with Atlassian products because “their business model is: 1. Collect requirement lists from customers and prospective customers; 2. Make sure their product checks every damn box, no matter how stupid.”"
  },
  {
    "name": "source",
    "url": "https://twitter.com/PavelASamsonov/status/1296818042928861184"
  },
  {
    "name": "The product roadmap is dead: welcome to the age of problem roadmaps",
    "url": "https://medium.com/product-managers-at-work/the-product-roadmap-is-dead-welcome-to-the-age-of-problem-roadmaps-7c7745ac8ae0",
    "description": "“Fall in love with your problems and not with your solutions.”"
  },
  {
    "name": "Kasparov's Law",
    "url": "https://web.archive.org/web/20220120220730/https://curatedintelligence.wordpress.com/2017/10/20/kasparovs-law/",
    "description": "Weak human + Machine > Machine > Strong Human."
  },
  {
    "name": "The Psychology of Design",
    "url": "https://growth.design/psychology/",
    "description": "An extensive list of cognitive biases and design principles with examples and tips to fine-tune your product and UX."
  },
  {
    "name": "Marketing for Engineers",
    "url": "https://github.com/LisaDziuba/Marketing-for-Engineers",
    "description": "Lots of resources to help bootstrap your marketing activies and solve practical tasks."
  },
  {
    "name": "How the biggest consumer apps got their first 1,000 users",
    "url": "https://www.lennyrachitsky.com/p/how-the-biggest-consumer-apps-got",
    "description": "How the biggest apps out there started: from going to your user directly (both online and offline), creating FOMO and word-of-mouth, to build a community first and get press."
  },
  {
    "name": "Let's have no managers, instead of managers with no engineering experience",
    "url": "https://medium.com/hackernoon/lets-have-no-managers-instead-of-managers-with-no-engineering-experience-e8b7cd29d398",
    "description": "The title is misleading, article's argument is: we don't need project managers if we already have product managers and scrum masters."
  },
  {
    "name": "Best project management practices in 2018?",
    "url": "https://news.ycombinator.com/item?id=16377523",
    "description": "There is no silver bullet."
  },
  {
    "name": "Strategies for long Projects",
    "url": "http://benbrostoff.github.io/2019/09/28/long-projects.html",
    "description": "Relentless, irrational optimism; Daily progress documentation; Compounding investments; Time budgeting."
  },
  {
    "name": "Developers can't fix bad management",
    "url": "https://iism.org/article/developers-can-t-fix-bad-management-57",
    "description": "“Why do so many software projects fail? Software development is much closer to creating a new factory than running an existing factory. (…) Software development is made up of many unknown duration tasks, this fundamentally unpredictable nature makes traditional management's predictive planning techniques particularly unsuited for software projects.”"
  },
  {
    "name": "Essays on object-oriented software engineering",
    "url": "https://www.amazon.com/dp/0132888955?&linkCode=ll1&tag=kevideld-20&linkId=559e579e5b00fde12559bbbb91ec1b95&language=en_US&ref_=as_li_ss_tl",
    "description": "Essays on object-oriented software engineering."
  },
  {
    "name": "The art of destroying software",
    "url": "https://www.youtube.com/watch?v=Ed94CfxgsCA",
    "description": "Greg Young described a good way to deal with requirements volatility: optimize from the beginning to be able to delete your code, and structure your code so that any part of it is no bigger than 1 week's worth of coding. So that any part can be re-written in 1 week."
  },
  {
    "name": "Requirements volatility is the core problem of software engineering",
    "url": "https://stackoverflow.blog/2020/02/20/requirements-volatility-is-the-core-problem-of-software-engineering/",
    "description": "“Start by accepting that change is inevitable. (…) As a consequence of this, software is never finished, only abandoned. (…) This means that no software product is ever exactly, perfectly satisfactory.”"
  },
  {
    "name": "Don't (guess)timate your projects, forecast with confidence",
    "url": "https://www.reaktor.com/blog/forecasting-method/",
    "description": "“The problem with spending a lot of time on estimating is that it can feel useful, but often is so inaccurate that it hardly yields much value to the business.” The best we can do is measure and forecast."
  },
  {
    "name": "Dear Startup: You have no idea how much that costs",
    "url": "http://kyleprifogle.com/dear-startup/",
    "description": "“We are completely clueless about how long things should take.” Here is a trick to handle expectation of unreasonable estimates."
  },
  {
    "name": "Escalation of commitment",
    "url": "https://en.wikipedia.org/wiki/Escalation_of_commitment",
    "description": "A.k.a. sunk-cost fallacy, or the rational explanation of why the hell do we still irrationally keep investing in a bad project."
  },
  {
    "name": "Who are you trying to impress with your deadlines?",
    "url": "https://web.archive.org/web/20200102054540/http://jatins.gitlab.io/me/why-deadline/",
    "description": "“There are companies where those deadlines are set in stone, and a missed deadline is next to fire. That's when the problem starts.”"
  },
  {
    "name": "Apple Aperture: Senior QA",
    "url": "https://techreflect.net/2019/12/10/aperture-senior-qa-2004-2005/",
    "description": "How not to manage projects approaching deadlines: “cutting finished features, yelling at people, and working people to the point of nervous breakdowns. Then they came upon a brilliant idea: let's steal over a hundred engineers from other teams and then the project will magically get done on time.”"
  },
  {
    "name": "Robert \"Uncle Bob\" Martin talk about professionalism in software development",
    "url": "https://youtu.be/LmRl0D-RkPU?t=3202",
    "description": "The only honest estimate is \"I don't know\". But you can come up with some kind of propability assessment, that will inform about the shape of the risk. This is not unlike PERT, where an activity is bounded by optimistic, pessimistic and most-likely time. Now if managers don't take a range for an answer, don't fall in that trap. Tell them you're already trying as you possibly can. “And then the manager will have to do something very foreign: they'll have to manage. That's what management is: managing risk.”"
  },
  {
    "name": "Why software projects take longer than you think: a statistical model",
    "url": "https://erikbern.com/2019/04/15/why-software-projects-take-longer-than-you-think-a-statistical-model.html",
    "description": "“Confirms the hunch that developers estimate the median well, but the mean ends up being much higher.”"
  },
  {
    "name": "Developers spend most of their time figuring the system out",
    "url": "https://lepiter.io/feenk/developers-spend-most-of-their-time-figuri-9q25taswlbzjc5rsufndeu0py/",
    "description": "“A hand drawn picture about the current system is a belief. Decisions should never be based on beliefs. Not in engineering. (…) As software is highly contextual we cannot predict specific problems. We can only predict classes of problems.” And that's why it is hard to estimate software projects: because developer's main activity is a long process of deducting the assumptions a system is built on."
  },
  {
    "name": "Software effort estimation is mostly fake research",
    "url": "https://shape-of-code.com/2021/01/17/software-effort-estimation-is-mostly-fake-research/",
    "description": "“The NASA dataset contains 93 rows (that is not a typo, there is no power-of-ten missing), COCOMO 63 rows, Desharnais 81 rows, and (…) the China dataset contains 499 rows.”"
  },
  {
    "name": "There Are No Bugs, Just TODOs",
    "url": "https://almad.blog/essays/no-bugs-just-todos/",
    "description": "Issue trackers needs to materialize ownership, queue position, state, task breakdown and aggressive closing. Priority, ticket type, software version, severity and long-life tickets are anti-patterns."
  },
  {
    "name": "GitHub labels for reuse across projects",
    "url": "https://twitter.com/abdonrd/status/991697736230633474",
    "description": "Simple yet practical."
  },
  {
    "name": "The SAFe Delusion",
    "url": "https://safedelusion.com",
    "description": "Curated review of facts, evidence, and opinions from relevant sources without vested interests, to help decision-makers make informed choices and get better results."
  },
  {
    "name": "How Big Tech Runs Tech Projects and the Curious Absence of Scrum",
    "url": "https://newsletter.pragmaticengineer.com/p/project-management-in-tech",
    "description": "There's an interesting table in this article on the strereotypes of companies, their funding models, main engineering actors, and their central methodologies."
  },
  {
    "name": "Why do some developers at Google consider Agile development to be nonsense?",
    "url": "https://www.quora.com/Why-do-some-developers-at-strong-companies-like-Google-consider-Agile-development-to-be-nonsense/answer/David-Jeske",
    "description": "Because the short-term focused Scrum processes “seem suited to particular types of development, most notably consulting or contract programming, where the customer is external to the organizations, runs the show because they are paying for development, and can change their mind at any time”. Still, google engineers already practice a culture close to what looks like the original 10-points Agile manifesto. But that's it."
  },
  {
    "name": "Story Points Revisited",
    "url": "https://ronjeffries.com/articles/019-01ff/story-points/Index.html",
    "description": "The alleged inventor of story points says they are probably a mistake."
  },
  {
    "name": "Detecting Agile Bullshit",
    "url": "https://media.defense.gov/2018/Oct/09/2002049591/-1/-1/0/DIB_DETECTING_AGILE_BS_2018.10.05.PDF",
    "description": "US Department of Defense guide to detect software projects that are really using agile development versus those that are simply waterfall or spiral development in agile clothing (“agile-scrum-fall”)."
  },
  {
    "name": "source",
    "url": "https://news.ycombinator.com/item?id=20326074"
  },
  {
    "name": "Failed #SquadGoals - Spotify doesn't use \"the Spotify model\" and neither should you",
    "url": "https://www.jeremiahlee.com/posts/failed-squad-goals/",
    "description": "Spotify doesn't use \"the Spotify model\" and neither should you - “Why it didn't work? 1. Matrix management solved the wrong problem; 2. It fixated on team autonomy; 3. Collaboration was an assumed competency; 4. Mythology became difficult to change”."
  },
  {
    "name": "Recurring opinions or productive improvements — what agile teams actually discuss in retrospectives",
    "url": "https://link.springer.com/article/10.1007/s10664-016-9464-2",
    "description": "An 3-years analysis of a team's retrospectives, with dire conclusions: people keep forgetting what they already learned, keep discussing unsolveable problems out of their control, and keep debating opinions based on biased interpretations or incorrect understandings."
  },
  {
    "name": "W. Edwards Deming",
    "url": "https://www.amazon.com/Out-Crisis-W-Edwards-Deming/dp/0911379010?_encoding=UTF8&qid=&sr=&linkCode=ll1&tag=kevideld-20&linkId=ec7a442a2cd5bfcfb5b6c32ea1409f2f&language=en_US&ref_=as_li_ss_tl",
    "description": "W. Edwards Deming"
  },
  {
    "name": "SRE fundamentals: SLIs, SLAs and SLOs",
    "url": "https://cloudplatform.googleblog.com/2018/07/sre-fundamentals-slis-slas-and-slos.html",
    "description": "If you are in the business of cloud services, these metrics are certainly great KPIs."
  },
  {
    "name": "The 4 Worst Software Metrics Agitating Developers in 2019",
    "url": "https://www.gitclear.com/blog/the_4_worst_software_metrics_agitating_developers_in_2019",
    "description": "The worst KPIs to track a software team output: Lines of Code, Commit Count, Issues Resolved (aka “Shipping Velocity”) and Code Churn (aka \"Efficiency\")."
  },
  {
    "name": "OKRs from a development team's perspective",
    "url": "https://zafulabs.com/2019/05/24/okrs-from-a-development-teams-perspective/",
    "description": "On how OKRs articulates with a backlog."
  },
  {
    "name": "Team Objectives – Overview",
    "url": "https://svpg.com/team-objectives-overview/",
    "description": "Why OKRs might not work at your company: 1. You're still using feature teams instead of product teams; 2. Mixed-up manager and individual objectives; 3. Leadership opting-out of active management."
  },
  {
    "name": "source",
    "url": "https://news.ycombinator.com/item?id=19550614",
    "description": "Or how OKRs can be weaponized to prevent top managers to mess with the (already established) schedule."
  },
  {
    "name": "Why individual OKRs don't work for us",
    "url": "https://hrblog.spotify.com/2016/08/15/our-beliefs/",
    "description": "Spotify decision to stop using OKRs for individuals."
  },
  {
    "name": "Google's usage of OKRs",
    "url": "https://news.ycombinator.com/item?id=17492038",
    "description": "OKR grades are public, but not used for promotion. It was never taken very seriously there."
  },
  {
    "name": "Awesome OKR",
    "url": "https://github.com/domenicosolazzo/awesome-okr",
    "description": "There is no shortage of content on how to measure and communicate objectives."
  },
  {
    "name": "Developers mentoring other developers: practices I've seen work well",
    "url": "https://blog.pragmaticengineer.com/developers-mentoring-other-developers/",
    "description": "Discusses mentorship practices that work well engineer-to-engineer."
  },
  {
    "name": "What Medieval People Got Right About Learning",
    "url": "https://www.scotthyoung.com/blog/2019/06/07/apprenticeships/",
    "description": "“Why apprenticeships beat classrooms”."
  },
  {
    "name": "Developer Roadmaps",
    "url": "https://roadmap.sh/roadmaps",
    "description": "Very high-level guides and paths to learn different practice and tools."
  },
  {
    "name": "What senior engineers do: fix knowledge holes",
    "url": "http://www.mooreds.com/wordpress/archives/3232",
    "description": "“This is the textbook definition of a senior engineer. You see a problem, you solve it (thoroughly), you document it and you level up your team.”"
  },
  {
    "name": "Chesterton's fence",
    "url": "https://en.wikipedia.org/wiki/Wikipedia:Chesterton%27s_fence",
    "description": "“If you're considering nominating something for deletion, or changing a policy, because it doesn't appear to have any use or purpose, research its history first.” It's not we'd like to play conservative here, but because we need to fix the knowledge hole as described above."
  },
  {
    "name": "You're Not Managing a Team of Software Engineers, You're Managing a Team of Writers",
    "url": "https://medium.com/coaching-notes/youre-not-managing-a-team-of-software-engineers-you-re-managing-a-team-of-writers-b263d3a10cc7",
    "description": "Because writing software is “a creative process which is by its nature unpredictable and personal, in an environment which craves certainty, predictability and consistency.”"
  },
  {
    "name": "How to Read a Paper",
    "url": "http://svr-sk818-web.cl.cam.ac.uk/keshav/papers/07/paper-reading.pdf",
    "description": "Outlines a practical and efficient three-pass method for reading research papers."
  },
  {
    "name": "What nobody tells you about documentation",
    "url": "https://www.divio.com/blog/documentation/",
    "description": "There is four kinds of documentation: tutorials, how-to guides, explanation and reference. Each with their own structure and mode of writing."
  },
  {
    "name": "Flying Circus Platform - Disaster recovery",
    "url": "https://flyingcircus.io/doc/reference/security/disaster-recovery.html#disaster-recovery",
    "description": "Disaster recovery - Critical infrastructure which aims to be available 24/7 needs a Disaster Recovery Plan. It generally takes the form of a document providing an overview of the expected severe failures and a set of procedures on how the system and the team operating it is prepared to deal with. The one linked here is a great example of such document, and is strong evidence the team is prepared for the worse."
  },
  {
    "name": "How to Write a Technical Paper",
    "url": "https://pdfs.semanticscholar.org/441f/ac7c2020e1c8f0d32adffca697bbb8a198a1.pdf",
    "description": "Serves as a guideline on how to write a good technical paper, in the form of a typical journal publication."
  },
  {
    "name": "Learning Technical Writing Using the Engineering Method",
    "url": "https://www.cs.tufts.edu/~nr/pubs/learn.pdf",
    "description": "An alternative approach, involving a weekly meeting of a writing group. An interesting dynamic to gather feedback and experience."
  },
  {
    "name": "Technical Writing Courses",
    "url": "https://developers.google.com/tech-writing",
    "description": "This collection of courses and learning resources aims to improve your technical documentation. Learn how to plan and author technical documents. You can also learn about the role of technical writers in a company."
  },
  {
    "name": "Algorithm for writing a scientific manuscript",
    "url": "https://sci-hub.st/https://iubmb.onlinelibrary.wiley.com/doi/full/10.1002/bmb.20329",
    "description": "A process to guide the preparation and refinement of manuscripts."
  },
  {
    "name": "The Baldwin Formula for scientific writing: writing papers and reviews",
    "url": "https://www.ice.mpg.de/ext/fileadmin/extranet/dept_itb/The_Baldwin_Formula_for_writing_a_scientific_paper_and_reviewing_papers.pdf",
    "description": "“The most efficient way to write scientific papers is to write while you are still conducting experiments”."
  },
  {
    "name": "Ten simple rules for structuring papers",
    "url": "https://www.biorxiv.org/content/10.1101/088278v5.full.pdf",
    "description": "“Focusing on how readers consume information, we present a set of 10 simple rules to help you get across the main idea of your paper.”"
  },
  {
    "name": "Tips for Writing Technical Papers",
    "url": "https://cs.stanford.edu/people/widom/paper-writing.html",
    "description": "Another set of tips, specifically using the example of a technical paper describing an improvement of an algorithm."
  },
  {
    "name": "Write an Excellent Programming Blog",
    "url": "https://speakerdeck.com/pycon2016/a-jesse-jiryu-davis-write-an-excellent-programming-blog",
    "description": "Tips on structure and style to produce great blog posts."
  },
  {
    "name": "Ten simple rules for getting started on Twitter as a scientist",
    "url": "https://journals.plos.org/ploscompbiol/article?id=10.1371/journal.pcbi.1007513",
    "description": "Twitter “can be used in a much more active, collaborative way: to ask for advice, to form new bonds and scientific collaborations, to announce jobs and find employees, to find new mentors and jobs.”"
  },
  {
    "name": "Notes on Technical Writing",
    "url": "https://mkaz.blog/misc/notes-on-technical-writing/",
    "description": "An effective list of do and don't when it comes to writing documentation."
  },
  {
    "name": "Writing for Business",
    "url": "https://docs.google.com/document/d/1PqbdAnYM79tLvO3yWCt2QH2T1HuQ58poNUsM7QzuE-c",
    "description": "Some tips on how to write in a business context."
  },
  {
    "name": "Please don't say just hello in chat",
    "url": "https://nohello.net/en/",
    "description": "When properly used, interactive written medium allows for asynchronous communication."
  },
  {
    "name": "BLUF: The Military Standard That Can Make Your Writing More Powerful",
    "url": "https://www.animalz.co/blog/bottom-line-up-front/",
    "description": "“BLUF is a military communications acronym—it stands for “bottom line up front”—that's designed to enforce speed and clarity in reports and emails.”"
  },
  {
    "name": "LanguageTool",
    "url": "https://languagetool.org",
    "description": "Proofreading for grammar, style and spell checking."
  },
  {
    "name": "English Lint",
    "url": "https://github.com/killercup/english-lint",
    "description": "A Rust CLI to detect weasel words, passive voice and lexical illusions."
  },
  {
    "name": "proselint",
    "url": "https://github.com/amperser/proselint/",
    "description": "Places the world's greatest writers and editors by your side, where they whisper suggestions on how to improve your prose."
  },
  {
    "name": "Bias-free communication",
    "url": "https://docs.microsoft.com/en-us/style-guide/bias-free-communication",
    "description": "Microsoft's guide on how to improve writing to be more inclusive and diverse."
  },
  {
    "name": "alex",
    "url": "https://github.com/get-alex/alex",
    "description": "Whether your own or someone else's writing, alex helps you find gender favoring, polarizing, race related, religion inconsiderate, or other unequal phrasing in text."
  },
  {
    "name": "BlaBlaMeter - Bullshit detection tool",
    "url": "http://www.blablameter.com/",
    "description": "Bullshit detection tool - Produce a normalized metric of the bullshit content of a text."
  },
  {
    "name": "Marketing BS Detector",
    "url": "http://marketingbs.whiterhino.com",
    "description": "Same as above, but with some tips given."
  },
  {
    "name": "The Punctuation Guide",
    "url": "https://www.thepunctuationguide.com",
    "description": "Simple reference on how (and why) to use these special characters."
  },
  {
    "name": "Improve Your Writing With The GNU Style Checkers",
    "url": "https://www.linux.com/news/improve-your-writing-gnu-style-checkers/",
    "description": "How to use style and diction, two venerable GNU utilities."
  },
  {
    "name": "JStylo & Anonymouth",
    "url": "https://github.com/spencermwoo/anonymouth",
    "description": "Authorship attribution analysis tool and evasion (anonymization) framework."
  },
  {
    "name": "It's time to start writing",
    "url": "https://alexnixon.github.io/2019/12/10/writing.html",
    "description": "On “Jeff Bezos's dotcom-era policy of banning PowerPoint within Amazon”, and how “this is neither about powerpoint nor about reading - it's about thinking.”"
  },
  {
    "name": "Presentation Rules",
    "url": "https://web.archive.org/web/20220720230551/http://www.jilles.net/perma/2020/06/05/presentation-rules.html",
    "description": "A set of 16 rules to avoid boring and ineffective presentations, and have your message reach your audience."
  },
  {
    "name": "The Greatest Sales Deck I've Ever Seen",
    "url": "https://medium.com/the-mission/the-greatest-sales-deck-ive-ever-seen-4f4ef3391ba0",
    "description": "“1. Name a big change in the world; 2. Show there'll be winners and losers; 3. Tease the promised land; 4. Introduce features as \"Magic Gifts\"; 5. Present evidence that you can make the story come true.”"
  },
  {
    "name": "Some tips on public speaking",
    "url": "https://news.ycombinator.com/item?id=6199544",
    "description": "“If you ever find yourself buffering on output, rather than making hesitation noises, just pause. People will read that as considered deliberation and intelligence.”"
  },
  {
    "name": "Work at different management levels",
    "url": "https://larahogan.me/blog/manager-levels/",
    "description": "A great progressive breakup of what it feels like to work at different levels of management."
  },
  {
    "name": "Levels of abstraction in engineering management",
    "url": "https://medium.com/@rvprabhu/levels-of-abstraction-in-engineering-management-6bac9410e89a",
    "description": "Another take on the differences between Manager, Manager of Managers, Head of Org and Head of Function."
  },
  {
    "name": "My questions for prospective employers (Director/VP roles)",
    "url": "https://jacobian.org/2019/apr/23/questions-for-employers-director-vp/",
    "description": "Be prepared to ask them as a recruiter or being asked about them for senior management roles."
  },
  {
    "name": "Founder to CEO",
    "url": "https://docs.google.com/document/d/1ZJZbv4J6FZ8Dnb0JuMhJxTnwl-dwqx5xl0s65DE3wO8/",
    "description": "You can build you own career engine, starting as a technical founder of a startup, building a great team, then grow with the company to learn and become a full-fledge CEO."
  },
  {
    "name": "How title, money and scope affect your fulfillment",
    "url": "https://twitter.com/shreyas/status/1268372416427786240",
    "description": "“For talented mid-career folks, when making job changes, how do you rank: 1. Title 2. Money 3. Scope”."
  },
  {
    "name": "Amazon Wants to 'Win at Games.' So Why Hasn't It?",
    "url": "https://www.wired.com/story/amazon-wants-to-win-at-games-so-why-hasnt-it/",
    "description": "“Any product manager can go between any business—from groceries to film to games to Kindle. The skillset is interchangeable. They just have to learn the particular market.”"
  },
  {
    "name": "Baumol",
    "url": "https://en.wikipedia.org/wiki/Baumol%27s_cost_disease",
    "description": "Explains how the pool of professional managers gets distributed into the various sectors of the economy."
  },
  {
    "name": "How do managers get stuck?",
    "url": "http://www.elidedbranches.com/2017/09/how-do-managers-get-stuck.html",
    "description": "Identify scenario preventing managers to be promoted at the next level."
  },
  {
    "name": "The Evolution of Management: Transitioning up the ladder",
    "url": "https://queue.acm.org/detail.cfm?id=3350548",
    "description": "Describe the path and expectations at each management level."
  },
  {
    "name": "If management isn't a promotion, then engineering isn't a demotion",
    "url": "https://charity.wtf/2020/09/06/if-management-isnt-a-promotion-then-engineering-isnt-a-demotion/",
    "description": "This essay deconstruct why management ends up being seen as a promotion, how its new acquired privileges and powers creates an implicit hierarchy, which in turns creates bad incentives because of loss aversion. At the end, the only way forwards is to change the organization's culture."
  },
  {
    "name": "How to discipline overeager engineer",
    "url": "https://workplace.stackexchange.com/questions/145709/how-to-discipline-overeager-engineer",
    "description": "Over-achieving talent is looking for a management promotion. Management does not recognize effort. Engineer become disgruntled and management is looking to discipline him. A case-study of a bad situation in which both side shows clumsiness."
  },
  {
    "name": "source",
    "url": "https://news.ycombinator.com/item?id=11833832",
    "description": "Do not chase promotion for the title only."
  },
  {
    "name": "For all you future CTOs, consider your incentive schemes carefully",
    "url": "https://news.ycombinator.com/item?id=24463676",
    "description": "How a promotion scheme marked the end of Uber's engineering excellence and the start of what made the company turn into a bureaucratic mess."
  },
  {
    "name": "How to get promoted",
    "url": "https://defmacro.substack.com/p/how-to-get-promoted",
    "description": "The cynical take: “an opportunist's career advice is: ignore OKRs, switch projects well before the consequences of your decisions can be measured, act happy and easy-going, package bad news as appeals for slow systemic adjustments, don't make anyone look bad, perform rituals with enthusiasm, grow headcount faster than baseline, let work invent itself, follow management fashions, avoid acute failures, believe this sincerely.”"
  },
  {
    "name": "Get your work recognized: write a brag document",
    "url": "https://jvns.ca/blog/brag-documents/",
    "description": "There's this idea that, if you do great work at your job, people will (or should!) automatically recognize that work and reward you for it with promotions / increased pay. In practice, it's often more complicated than that."
  },
  {
    "name": "Incentive Pay Considered Harmful",
    "url": "https://www.joelonsoftware.com/2000/04/03/incentive-pay-considered-harmful/",
    "description": "“Incentives (or bribes) simply can't work in the workplace. (…) Most software managers have no choice but to go along with performance review systems that are already in place. If you're in this position, the only way to prevent teamicide is to simply give everyone on your team a gushing review”."
  },
  {
    "name": "source",
    "url": "https://news.ycombinator.com/item?id=17249767"
  },
  {
    "name": "source",
    "url": "https://news.ycombinator.com/item?id=23861960"
  },
  {
    "name": "source",
    "url": "https://news.ycombinator.com/item?id=21972033"
  },
  {
    "name": "Performance review generator",
    "url": "https://mschmitt.org/performance/",
    "description": "Tired of writing reviews? Automate it!"
  },
  {
    "name": "levels.fyi",
    "url": "https://www.levels.fyi",
    "description": "Compares salary range and compensation charts across big tech companies."
  },
  {
    "name": "benefits.fyi",
    "url": "https://benefits.fyi",
    "description": "Same as above, but trying to evaluate the values of benefits across companies."
  },
  {
    "name": "L8-L10 salaries at AWS",
    "url": "https://news.ycombinator.com/item?id=21823987",
    "description": "A reference point to what $M+ compensation packages looks like."
  },
  {
    "name": "Salaries never stay secrets forever. Hiding them only delays the inevitable.",
    "url": "https://news.ycombinator.com/item?id=2439478"
  },
  {
    "name": "source",
    "url": "https://news.ycombinator.com/item?id=21868845"
  },
  {
    "name": "On VC funding and huge growth",
    "url": "https://news.ycombinator.com/item?id=17448035",
    "description": "“Startups need an exit strategy. (…) The idea is to raise money fast, hire experienced people for ancillary services and develop the application in a way so that it is able to hold up till IPO. Defer all costs for post IPO.” So from this angle, the only reason to join a startup is for future money windfall."
  },
  {
    "name": "Equity Compensation",
    "url": "https://www.holloway.com/g/equity-compensation",
    "description": "Stock options, RSUs, job offers, and taxes—a detailed reference, including hundreds of resources, explained from the ground up and made to be improved over time."
  },
  {
    "name": "source",
    "url": "https://news.ycombinator.com/item?id=22386728"
  },
  {
    "name": "About corporate middle management",
    "url": "https://news.ycombinator.com/item?id=28336658",
    "description": "“As a manager in a large corporation you are expected to be an aligner. (…) You have to manage frictions and strive to make the people above you look good.”"
  },
  {
    "name": "source",
    "url": "https://news.ycombinator.com/item?id=22808280"
  },
  {
    "name": "HiPPO FAQ",
    "url": "https://exp-platform.com/hippo/",
    "description": "HiPPO stands for “Highest Paid Person's Opinion”, a trait of dysfunctional culture, in which power politics trumps data."
  },
  {
    "name": "The Prince",
    "url": "https://en.wikipedia.org/wiki/The_Prince",
    "description": "Machiavelli's ideas on how to accrue honor and power as a leader. Resorting to that level of politics in a company is a sure way to render the culture highly toxic, as well as corrupting and demoralizing the organization at all levels."
  },
  {
    "name": "The Gervais Principle",
    "url": "https://www.ribbonfarm.com/the-gervais-principle/",
    "description": "A cynical, bleak, but still fascinating take on the management ladder, based on The Office."
  },
  {
    "name": "The 48 Laws of Power",
    "url": "https://www.amazon.com/dp/0140280197?&linkCode=ll1&tag=kevideld-20&linkId=bf129d7f7a3495a445cf2bf667d3d3c6&language=en_US&ref_=as_li_ss_tl",
    "description": "By Robert Greene. Can teach you how to cover your ass and be effective in a highly political org."
  },
  {
    "name": "Selectorate theory",
    "url": "https://en.wikipedia.org/wiki/Selectorate_theory",
    "description": "“In selectorate theory, three groups of people affect leaders. These groups are the nominal selectorate, the real selectorate, and the winning coalition. (…) To remain in power, leaders must maintain their winning coalition.”"
  },
  {
    "name": "Circulation of elite",
    "url": "https://en.wikipedia.org/wiki/Circulation_of_elite",
    "description": "“Changes of regime, revolutions, and so on occur not when rulers are overthrown from below, but when one elite replaces another.”"
  },
  {
    "name": "The Rules for Rulers",
    "url": "https://www.youtube.com/watch?v=rStL7niR7gs",
    "description": "“Smart key supporters will always watch the balance of power, ready to change allegience if the ruler look to be the loser in a shifting web of alliances. (…) Buy all the loyalty you can, because loyalty, in dictatorial organizations of all kinds, is everything.”"
  },
  {
    "name": "source",
    "url": "https://news.ycombinator.com/item?id=21925738"
  },
  {
    "name": "“Company I've worked for had manager who tried to ship features over the weekend with a ragtag team of developers who don't understand why that's a bad idea.”",
    "url": "https://news.ycombinator.com/item?id=22285123",
    "description": "Tactics of hustling managers, and how the company reacting to that kind of manager makes or break a good place to work."
  },
  {
    "name": "Making Nice or Faking Nice? Exploring Supervisors' Two-Faced Response to their Past Abusive Behavior",
    "url": "https://onlinelibrary.wiley.com.sci-hub.st/doi/10.1111/peps.12424",
    "description": "“It behooves organizations that want to develop highly authentic supervisors or organizational climates to seek to hire supervisors that are lower (or at least not higher) on symbolized moral identity.”"
  },
  {
    "name": "comment",
    "url": "https://news.ycombinator.com/item?id=20260498"
  },
  {
    "name": "source",
    "url": "https://news.ycombinator.com/item?id=21230771"
  },
  {
    "name": "source",
    "url": "https://news.ycombinator.com/item?id=20220484"
  },
  {
    "name": "source",
    "url": "https://news.ycombinator.com/item?id=5541517"
  },
  {
    "name": "Power Bends Light",
    "url": "https://honkathon.com/2019-08-18-power-bends-light/",
    "description": "“Most things at most startups are perpetually on fire, but if you can accept that, there is a lot to like. One well-known one: at a fast-growing startup, a hard-working, talented person who has some support from company leadership can often acquire an impressive title (or at least a lot of de facto power) very quickly.”"
  },
  {
    "name": "source",
    "url": "https://news.ycombinator.com/item?id=21767734"
  },
  {
    "name": "US spy manual has tips for coping with toxic bosses",
    "url": "https://qz.com/work/1717297/how-to-cope-with-a-toxic-boss-according-to-a-us-spy-manual-from-wwii/",
    "description": "Derived from WWII-era Simple Sabotage Field Manual, a classic read to spot harassing and demoralizing behaviors."
  },
  {
    "name": "4 Clues to Identify a Destructive Leader",
    "url": "https://articles.tilt365.com/identify-destructive-leadership-patterns/",
    "description": "“1. I'm kind of a big deal! 2. None of this is my fault! 3. Just do what I say! 4. Trust me; I'm never wrong.”"
  },
  {
    "name": "source",
    "url": "https://threadreaderapp.com/thread/1494369809538195456.html",
    "description": "Contemplating to switch from the industry? The grass is not greener in academia. Given a significant size, any organization comes with its political game."
  },
  {
    "name": "Why it's difficult to build teams in high growth organisations",
    "url": "https://jchyip.medium.com/why-its-difficult-to-build-teams-in-high-growth-organisations-e1aee8446337",
    "description": "Describes 3 different approach a manager can take to accommodate new people in the team: 1. Sink or Swim; 2. Split and Absorb; 3. Absorb and Split."
  },
  {
    "name": "Teams are like bread",
    "url": "https://blog.jessitron.com/2019/06/15/teams-are-like-bread/",
    "description": "Resonates with the Absorb and Split strategy discussed above: “if you have one team where the magic is flourishing, don't kill it. Feed it, grow it, and let it be a source of further strong teams. No rushing.”"
  },
  {
    "name": "Building a data team at a mid-stage startup: a short story",
    "url": "https://erikbern.com/2021/07/07/the-data-team-a-short-story.html",
    "description": "Story of a manager trying to distill the concepts of a data-driven company while growing a tiny team of 3 people. Each step covers the evolution of the technical pipeline and interactions with existing stakeholders."
  },
  {
    "name": "If I Close My Data Centers, What About the People/Jobs Lost?",
    "url": "https://news.ycombinator.com/item?id=17329028",
    "description": "F50's data centers being migrated to commercial cloud provider. But what about the people currently doing legacy stuff? The answer: retrain."
  },
  {
    "name": "source",
    "url": "https://news.ycombinator.com/item?id=20881308"
  },
  {
    "name": "I've Built Multiple Growth Teams. Here's Why I Won't Do It Again.",
    "url": "https://conversionxl.com/blog/dont-build-growth-teams/",
    "description": "“Few folks understand probability, and most executives don't care about the data, regardless of what it says.”"
  },
  {
    "name": "The SaaS Org Chart",
    "url": "https://sacks.substack.com/p/the-saas-org-chart",
    "description": "Blueprints of an organization at each stage of its 50/125/400/1000-employees stages, with typical ratios and ARR."
  },
  {
    "name": "source",
    "url": "https://news.ycombinator.com/item?id=20533922",
    "description": "theres your answer. If built correctly it's genuinely difficult to mess things up.” (source). I.e. the structure of the organization is quintessential to its longevity."
  },
  {
    "name": "A high-resilience org chart",
    "url": "https://jessitron.com/2021/05/26/a-high-resilience-org-chart/",
    "description": "“If you know what problem you're solving and you know how to solve it, a bureaucratic organization will do. Stick with what you know. If you're writing software, that's a generative activity. You need a high-resilience org chart. Fewer boxes, more flexibility.”"
  },
  {
    "name": "An Alternative Approach to Re-Orgs At Your Company",
    "url": "https://caseyaccidental.com/alternative-approach-re-orgs/",
    "description": "“Trying not to repeat re-org mistakes, we started working on a structure that would make the re-org act like a feedback-fueled progress driven by the teams instead of by people above them.” This is an attempt to extract from the ground up signals pointing to inadequate structure. My cautionary tale: this might only work up to a point depending on the company's culture."
  },
  {
    "name": "source",
    "url": "https://news.ycombinator.com/item?id=21395557"
  },
  {
    "name": "Speaking Truth to Power: Reflections on My Career at Microsoft",
    "url": "https://onezero.medium.com/speaking-truth-to-power-reflections-on-a-career-at-microsoft-90f80a449e36",
    "description": "After 3 decades in a deeply flawed company, the author comes to a humble conclusion: leaders should embodies the value of their employees. Not the other way around. “Changes at the top — not speeches, training or hashtags — make the most cultural impact. If you want real and lasting cultural change, sweep away the made-men who succeeded under the previous culture and promote the people who look, act, and think more like their employees than their managers.”"
  },
  {
    "name": "How the Digg team was acquihired",
    "url": "https://lethain.com/digg-acquihire/",
    "description": "Acqui-hire of a whole team can be seen as a type of reorg. In which managers will have to negotiate the new employment contracts in bulk in one or two days: “Because acquihires are “star” oriented, if you're a senior leaders who doesn't explicitly refuse to move forward, pressure will converge on you from all sides”."
  },
  {
    "name": "Good sleep, good learning, good life",
    "url": "https://supermemo.guru/wiki/Good_sleep,_good_learning,_good_life",
    "description": "An e-book-sized synthesis on sleep research “with a view to practical applications, esp. in people who need top-quality sleep for their learning or creative achievements.”"
  },
  {
    "name": "Should we take a few long holidays, or lots of short ones?",
    "url": "http://timharford.com/2019/09/should-we-take-a-few-long-holidays-or-lots-of-short-ones/",
    "description": "Short ones. “Reason one: holiday memories tend to depend not on how long the holiday was, but on the intensity of the experiences. Reason two: a change of activity can be a spur to creativity. Reason three for taking a short break: if we need rest to prevent exhaustion, a single, long vacation won't do the trick.”"
  },
  {
    "name": "The Toxic Handler: Organizational Hero — and Casualty",
    "url": "https://www.companiesalive.com/toxichandlers-healthandhealing-lifecoaching-miami-leadershiptraining.htm",
    "description": "“toxic handler, a manager who voluntarily shoulders the sadness, frustration, bitterness, and anger that are endemic to organizational life. Although toxic handlers may be found at every level in organizations, many work near the top”."
  },
  {
    "name": "Manager Energy Drain",
    "url": "https://larahogan.me/blog/manager-energy-drain/",
    "description": "“How do I handle how tired I am as a manager? 1. Defrag your calendar; 2. Delegate messy and unscoped projects; 3. Say no.”"
  },
  {
    "name": "How Slack Harms Projects",
    "url": "https://www.silasreinagel.com/blog/2019/08/12/how-slack-harms-projects/",
    "description": "“Promote a false sense of urgency, destroy focus, allow for bypassing project prioritization, strip away essential business context, encourage poorly thought-out communication”. To remediate this, see How to Use Slack and Not Go Crazy article."
  },
  {
    "name": "Examples of harassments",
    "url": "https://news.ycombinator.com/item?id=21856352",
    "description": "How a jealous boss, who felt either betrayed or ridiculed, bullied a capable employee to force him out. Don't be that kind of asshole boss."
  },
  {
    "name": "How shitty job crush your soul, then lead to burnout",
    "url": "https://news.ycombinator.com/item?id=7789438",
    "description": "“Burnout is a very serious situation. If you burn yourself out hard, it will be difficult to be effective at any future job you go to, even if it is ostensibly a wonderful job. Treat burnout like a physical injury.”"
  },
  {
    "name": "source",
    "url": "https://news.ycombinator.com/item?id=5630618"
  },
  {
    "name": "If You're So Successful, Why Are You Still Working 70 Hours a Week?",
    "url": "https://hbr.org/2018/02/if-youre-so-successful-why-are-you-still-working-70-hours-a-week",
    "description": "“Our tendency to overwork and burn out is framed by a complex combination of factors involving our profession, our organization, and ourselves. At the heart of it is insecurity.”"
  },
  {
    "name": "What Happens When Your Career Becomes Your Whole Identity",
    "url": "https://hbr.org/2019/12/what-happens-when-your-career-becomes-your-whole-identity",
    "description": "“A particular confluence of high achievement, intense competitiveness, and culture of overwork has caught many in a perfect storm of career enmeshment and burnout.”"
  },
  {
    "name": "source",
    "url": "https://news.ycombinator.com/item?id=21900054"
  },
  {
    "name": "Burnout From an Organizational Perspective",
    "url": "https://ssir.org/articles/entry/burnout_from_an_organizational_perspective",
    "description": "“Extensive research by the military on sustainable performance in stressful conditions teaches that leaders should become champions of health, rather than taskmasters.” Describe the symptoms of toxic organizations and how managers can protect their teams from systemic burnout."
  },
  {
    "name": "Avoiding burnout as an ambitious developer",
    "url": "https://stackoverflow.blog/2020/01/13/avoiding-burnout-as-an-ambitious-developer/",
    "description": "“Be willing to say no; Know what you don't want; Use your energy level realistically; Be kind to your future self”."
  },
  {
    "name": "Psychology Today: How Programmers Can Avoid Burnout",
    "url": "https://www.psychologytoday.com/us/blog/dear-life-please-improve/202008/how-does-your-tech-job-burn-you-out",
    "description": "“Veteran software developers often recommend to: 1. Work at a place where you can grow; 2. Build transferable skills; 3. Have creative outlets and create a space to focus on yourself, switch off, and relax; 4. Of course, there's always the nuclear option: make your money and get out.”"
  },
  {
    "name": "Average tenure of a CISO is just 26 months due to high stress and burnout",
    "url": "https://www.zdnet.com/article/average-tenure-of-a-ciso-is-just-26-months-due-to-high-stress-and-burnout/",
    "description": "“Today, CISO jobs come with low budgets, long working hours, a lack of power on executive boards, a diminishing pool of trained professionals they can hire, but also a constant stress of not having done enough to secure the company's infrastructure against cyber-attacks, continuous pressure due to newly arising threats, and little thanks for the good work done, but all the blame if everything goes wrong.”"
  },
  {
    "name": "Burnout Stage Analysis",
    "url": "https://catarina.skylyte.com",
    "description": "Better understand where you land on the spectrum of burnout."
  },
  {
    "name": "A quote",
    "url": "https://quoteinvestigator.com/2014/05/04/adapt/",
    "description": "A quote to tame the one above."
  },
  {
    "name": "Early-career setback and future career impact",
    "url": "https://www.nature.com/articles/s41467-019-12189-3",
    "description": "“Despite an early setback, individuals with near misses systematically outperform those with narrow wins in the longer run.”"
  },
  {
    "name": "Huge success in business is largely based on luck",
    "url": "https://theconversation.com/huge-success-in-business-is-largely-based-on-luck-new-research-130843",
    "description": "“Management research and education should focus on prescriptive theories that can help business practitioners move from 'incompetent to OK', rather than focusing on those that address how to move from 'good to great'.”"
  },
  {
    "name": "How Complex Systems Fail",
    "url": "https://web.mit.edu/2.75/resources/random/How%20Complex%20Systems%20Fail.pdf",
    "description": "“Short treatise on the nature of failure; how failure is evaluated; how failure is attributed to proximate cause; and the resulting new understanding of patient safety”."
  },
  {
    "name": "Normalization of deviance",
    "url": "https://danluu.com/wat/",
    "description": "Explores how the factors accounting for disasters accumulates unnoticed until it's too late. This has been studied on other fields, but not in software engineering."
  },
  {
    "name": "Steve Jobs explains - Why companies fail?",
    "url": "https://www.youtube.com/watch?v=B-fAinNDbQU&t=6s",
    "description": "Why companies fail? - On how sales and marketing takes over product focused companies."
  },
  {
    "name": "The failure of Scaling Etsy",
    "url": "https://twitter.com/mcfunley/status/1194713711337852928",
    "description": "When a company lacks technical leadership: developers waste time in costly refactors, over-engineered systems, and ends up detached from the business and product."
  },
  {
    "name": "Why I Rejected My Manager",
    "url": "https://medium.com/personal-growth/why-i-rejected-my-manager-b2273e354462",
    "description": "“I understand now why the saying is: people leave managers, not companies.”"
  },
  {
    "name": "Colleague is leaving. How to investigate what went wrong?",
    "url": "https://news.ycombinator.com/item?id=20786755",
    "description": "“Most of the time people leave bosses, not the job or the company.” And why you're unlikely to get any substantial insights from exit interviews. (source)"
  },
  {
    "name": "source",
    "url": "https://news.ycombinator.com/item?id=19755001"
  },
  {
    "name": "source",
    "url": "https://danluu.com/wat/#fn:P"
  },
  {
    "name": "source",
    "url": "https://news.ycombinator.com/item?id=21767843"
  },
  {
    "name": "Good business mafias form",
    "url": "https://marker.medium.com/where-do-business-mafias-come-from-34f47b33eecd",
    "description": "And why mass exodus might be an opportunity for great new ventures."
  },
  {
    "name": "source",
    "url": "https://news.ycombinator.com/item?id=4324615"
  },
  {
    "name": "P.T.'s Hidden Meaning",
    "url": "https://www.youtube.com/watch?v=yr4RvdREwl8",
    "description": "How Hideo Kojima creatively used a playable teaser as a way to bypass NDA and to tell he story about the turmoil at Konami leading to his leaving of the company. But that only works if you're an influential and popular game designer."
  },
  {
    "name": "Management Challenges for the 21st Century - Managing Oneself",
    "url": "http://academic.udayton.edu/lawrenceulrich/LeaderArticles/Drucker%20Managing%20Oneself.pdf",
    "description": "Managing Oneself - “There is a great deal of talk today about the \"mid-life crisis\" of the executive. It is mostly boredom. At age forty-five most executives have reached the peak of their business career and know it.” In paragraph Ⅴ, you'll find why knowledge workers needs to manage themselves, and plan for the second half of their life."
  }
]